{"id":1045,"date":"2010-10-01T17:51:04","date_gmt":"2010-10-01T09:51:04","guid":{"rendered":"http://xbeta.info/?p=1045"},"modified":"2010-10-01T17:51:04","modified_gmt":"2010-10-01T09:51:04","slug":"pdf-tools","status":"publish","link":"https://xbeta.info/pdf-tools.htm","title":{"rendered":"[待翻译] 最佳免费PDF工具软件"},"content":{"rendered":"<p>本计划纯翻译《最佳免费PDF工具软件(<a href=\"http://www.techsupportalert.com/content/best-free-pdf-tools.htm\">via</a>)》，但发现内容有很多可改进之处，故改为编译。鸣谢：techsupportalert、朝露昙花、天毅。</p>\n<h2>一、细说PDF编辑功能</h2>\n<p>　　PDF格式的产生，是为了“发布”——即文档在不同平台看起来尽可能相似。这一背景和目标，决定了PDF的特性就是“不易编辑”，或者说“天生不适合编辑”。很多所谓的编辑软件，也只是达到“勉强可用”的程度。期望像MS Word文档一样的轻松编辑，或Vim处理文本时的行云流水，目前绝无这样的软件，未来也不会有。<br />\n　　所谓的PDF编辑功能，在善用佳软看来，可分为三个层次：</p>\n<h3>1. 文件层次的编辑</h3>\n<p>　　PDF文件及一些元信息的修改，包括：<br />\n　　* 访问权限<br />\n　　* 加密或解密<br />\n　　* 书签<br />\n　　* 高亮、批注<br />\n　　* 添加水印<br />\n　　* PDF与其他格式（图像、文字、doc、htm、PostScript）的转换<br />\n　　* 初始视图格式</p>\n<h3>2. 页面层次的编辑</h3>\n<p>　　* 添加、删除、导出页面<br />\n　　* 页面顺序调整<br />\n　　* 页面旋转、裁剪<br />\n　　* 多文档合并<br />\n　　* 文档拆分<br />\n　　* 页眉、页脚<br />\n　　* 页码</p>\n<h3>3. 正文层次的编辑</h3>\n<p>　　* 对正文、图片的格式、内容、属性进行修改。<br />\n　　这一层次的修改尤为困难，并且，文字修改只能以行为单位，难以实现自动换行。</p>\n<h2 id=\"general\">二、综合类PDF编辑软件</h2>\n<h3 id=\"pdfill\">1. PDFill PDF Tools：多功能PDF处理软件</h3>\n<h4>* PDFill PDF Tools官方主页中译</h4>\n<p>官方主页：<a href=\"http://www.pdfill.com/pdf_tools_free.html\">http://www.pdfill.com/pdf_tools_free.html</a><br />\n软件名称：PDFill PDF Tools<br />\n软件口号：世界最强大的免费PDF工具集<br />\n支持平台：Windows 2000/XP/2003/Vista/Win7 (x32/x64)<br />\n安装条件：GhostScript<br />\n简介：PDFill PDF Tools，是一系列免费PDF处理工具的集合，包括：合并、拆分、页面重排、加密、解密、旋转、裁切、重新格式化、页眉、页脚、水印、PDF与图像互转、表单域的删除/去交互化/列表、PostScript转PDF、PDF信息、扫描为PDF、创建透明图像等功能。它无水印、无弹出广告、个人或商用都免费、可自由传播。<br />\n<img decoding=\"async\" src=\"http://www.pdfill.com/images/pdfill_tools.png\" alt=\"[PDFill PDF Tools]\"></p>\n<h4>* PDFill PDF Tools官方主页中译-续：基本功能</h4>\n<p>文件合并：[<a href=\"http://www.pdfill.com/images/pdftool_merge.png\">示例图</a>]<br />\n　　可选择多个文件，并排列顺序，然后合并为一个PDF文件。支持命令行，如<br />\n　　&#8221;C:Program FilesPlotSoftPDFillPDFill.exe&#8221;  MERGE Input1.pdf Input2.pdf Input3.pdf Output.pdf</p>\n<p>文件拆分、页面重整：<br />\n　　<img decoding=\"async\" src=\"http://www.pdfill.com/images/pdftool_split.png\" alt=\"[image]\"><br />\n　　指定把第x页到y页拆分出来；<br />\n　　页面重新排序，支持 1, 3-5, even, odd 这样的格式。<br />\n　　删除页面。<br />\n　　可把指定或余下的页面保存为文件。<br />\n　　可把每页保存为单独文件。<br />\n加密解密：<br />\n　　<img decoding=\"async\" src=\"http://www.pdfill.com/images/pdftool_encrypt.png\" alt=\"[image]\"><br />\n……待完成…………………………………………………………<br />\n　　<br />\n　　</p>\n<h4>* PDFill: 其他介绍</h4>\n<p><a href=\"http://blog.joaoko.net/archives/1295\">处理 PDF 的多功能工具箱 &#8211; PDFill PDF Tools</a></p>\n<h4>* techsupportalert评价</h4>\n<p>PDFill PDF Tools 是我最喜欢的一个工具，因其干净漂亮的用户界面，涵盖大多数功能，例如合并PDF文件，分割或重新排序页面，旋转或者修剪PDF页面，添加带数字的完整页眉和页脚等等。<br />\n可为需要检查的文档添加水印，只需输入文字例如“草稿”，或者为PDF添加一个背景图片。<br />\n一些额外的功能也被支持，例如带加密解密的安全功能；重新格式化多页至一页；把PDF表格域删除（flatten form：删除表单的交互性但是还有原来的外观）转换成列表；图片和PDF互转；或者把PostScript文件转换成PDF。<br />\n安装包里的 PDFill PDF Editor不是免费的，但是 PDFill PDF Tools 可以在安装后独立运行。这个免费的软件不支持其它功能，例如转换PDF为text格式，做注解等等。但是这些功能将在下边章节的工具里实现。<br />\n<a href=\"http://www.pdfill.com/images/pdfill_tools.png\"><img decoding=\"async\" src=\"http://www.pdfill.com/images/pdfill_tools.png\" alt=\"[image]\" width=\"200\"></a></p>\n<h3 id=\"pdftk-builder\">2. PDFTK Builder </h3>\n<p>说到PDFTK Builder，就不得不先介绍一下PDFTK。<a href=\"http://www.pdflabs.com/tools/pdftk-the-pdf-toolkit/\">PDFTK</a>是一款非常经典的跨平台、开源免费PDF处理工具。可以通过丰富的参数，实现各种功能。（<a href=\"http://www.pdflabs.com/docs/pdftk-cli-examples/\">示例</a>）PDFTK本身是 iText library 的一项前端应用，由 Sid Steward 于2004年起开发。而 PDFTK Builder 则是基于PDFTK的图形化界面。</p>\n<p>PDFTK主页：<a href=\"http://www.pdflabs.com/tools/pdftk-the-pdf-toolkit/\">www.pdflabs.com/tools/pdftk-the-pdf-toolkit/</a><br />\nPDFTK Builder主页：<a href=\"http://www.angusj.com/pdftkb/#pdftkbuilder\">www.angusj.com/pdftkb/</a></p>\n<p>* 一次完成合并或者修剪选定的PDF文件。<br />\n* 分割、旋转、添加背景/加标记和加密功能。<br />\n* 和PDFill PDF Tools相比，它缺乏一个基本功能：为PDF文档添加背景文字作为水印。这个功能在需要添加诸如“机密”、“草稿”或者其它文字到文档背景中显得尤为重要。<br />\n<a href=\"http://www.angusj.com/pdftkb/pdftkb.png\"><img decoding=\"async\" src=\"http://www.angusj.com/pdftkb/pdftkb.png\" alt=\"[image]\" width=\"200\"></a></p>\n<h3>3. jPDF Tweak </h3>\n<p>If you just need more features, jPDF Tweak will be a good choice but its user interface will not be better than any of the above two applications. Its merge, split and reorder functions are available under ‘input’ tab with a new filename to be entered under ‘output’ tab.</p>\n<p>jPDF Tweak offers rotate, watermark and format multiple pages, change page numbers and chapter bookmarks, and encrypt functions.</p>\n<p>It allows adding attachments to PDF documents, setting viewer preference and document properties including title, author, subject and keywords.<br />\n<a href=\"http://jpdftweak.sourceforge.net/screenshot.png\"><img decoding=\"async\" src=\"http://jpdftweak.sourceforge.net/screenshot.png\" width=\"200\" alt=\"[image]\"></a></p>\n<h3>4. PDF Shuffler: Linux下的综合工具</h3>\n<p>Re-arranging pages in a pdf document, or merging and splitting pdf files, would be much easier with PDF Shuffler.</p>\n<p>After importing one or more pdf files to PDF Shuffer, you are presented with the pages of files in thumbnails so that you can easily merge, re-order or delete the pages, or right-click a thumbnail to rotate or crop a page before exporting to a new pdf file.</p>\n<p>This program is a small application running on Linux. Some distros, such as Ubuntu 9.10, include this program in the repository for ease of download and setup.</p>\n<p><a href=\"http://www.techsupportalert.com/files/images/PDF-Shuffler.jpg\"><img decoding=\"async\" src=\"http://www.techsupportalert.com/files/images/PDF-Shuffler.jpg\" width=\"200\" alt=\"[image]\"></a></p>\n<h2>三、专项工具软件</h2>\n<p>    *<br />\n      To edit a PDF file, try Sun PDF Import Extension to OpenOffice.org. It allows PDF documents imported in Draw to preserve layout and edit small portion of text. This extension works further to allow you to import and modify PDF documents in OpenOffice from a PDF/ODF hybrid file with 100% layout accuracy. The hybrid pdf file is a pdf file containing an embedded odf source file. It can be viewed with a normal pdf viewer and can be opened with OpenOffice for full editing. See A PDF File Allows Editing in 100% Layout Accuracy for details.</p>\n<p>    *<br />\n      FreeOCR.netTo convert PDF to text, my choice is Some PDF to TXT Converter which preserves text and layout, supports drag and drop, batch conversion and encrypted pdf files. Alternatively, try the latest version of Adobe Reader which allows the user to save a copy of PDF as text.</p>\n<p>      FreeOCR.net is a scan and OCR (Optical Character Recognition) program and good for extracting text from scanned PDF documents. Moreover, images from scanned PDF documents can be selected and placed on the clipboard. Try also Free-OCR.com for an online OCR solution.<br />\n\t  <a href=\"http://www.softi.co.uk/freeocrnet.jpg\"><img decoding=\"async\" src=\"http://www.softi.co.uk/freeocrnet.jpg\" width=\"200\" alt=\"[image]\"></a></p>\n<p>    *<br />\n      Some PDF to Word ConverterTo convert PDF to Word/Excel, Some PDF to Word Converter allows removing line breaks and preserves paragraphs with soft returns. It supports batch conversion and encrypted pdf files, keeps images but does not preserve hyperlinks for the version under review.<br />\n\t  <a href=\"http://www.techsupportalert.com/files/images/Some-PDF-To-Word-Converter.gif\"><img decoding=\"async\" src=\"http://www.techsupportalert.com/files/images/Some-PDF-To-Word-Converter.gif\" width=\"200\" alt=\"[image]\"></a></p>\n<p>      Free online conversion is available from Nitro PDF for PDF-to-Word Converter and PDF-to-Excel Converter. Choose the file you need, click the &#8220;Convert&#8221; button and check your inbox for the converted files.</p>\n<p>    *<br />\n      7-PDF MakerTo convert various formats to PDF, 7-PDF Maker is a powerful tool to convert a wide range of formats to PDF. It is not ony able to convert files generated by Word, Excel, Powerpoint, OpenOffice, StarOffice, Maths and AutoCad, but also convert images, text or web based files to PDF. The setup comes with a Command line version or a Windows Explorer integration and the program supports user interface both in English and German even though the website is currently only available in German.<br />\n\t  <a href=\"http://www.techsupportalert.com/files/images/7-PDF-Maker.jpg\"><img decoding=\"async\" src=\"http://www.techsupportalert.com/files/images/7-PDF-Maker.jpg\" width=\"200\" alt=\"[image]\"></a></p>\n<p>      If you are using office applications such as OpenOffice and Jarte, they come with a feature to export files to PDF. Microsoft Office 2007 also allows a free add-in for saving documents as PDF.</p>\n<p>      Using either 7-PDF Maker or the above office applications, hyperlinks or bookmarks are nicely preserved in the converted or exported PDF files.</p>\n<p>      Alternatively you may install a virtual PDF printer, such as Bullzip, to create a PDF file by printing text or other contents via the PDF printer. However by doing so, hyperlinks and bookmarks are usually not preserved in the resulting PDF file.</p>\n<p>      i2pdfIf you are only converting various image files to PDF, my favorite goes to i2pdf. It works even better than the tool &#8220;Convert Images to PDF&#8221; included in PDFill PDF Tools. Download and unzip i2pdf, run the executable directly and no installation is required. This program is portable and user friendly &#8212; just drag and drop the images on the program window, click &#8220;Build PDF&#8221; button and it&#8217;s done. In setting the page output, &#8220;paperless&#8221; format is helpful for converting portrait and landscape images to the PDF file and view it on the screen without blank paper margins.<br />\n\t  <a href=\"http://web.newsguy.com/lmgava/i2pdf/sshot_1.jpg\"><img decoding=\"async\" src=\"http://web.newsguy.com/lmgava/i2pdf/sshot_1.jpg\" width=200 alt=\"[image]\"></a></p>\n<p>      How about converting files to PDF online? 7-PDF Web Portal and many other websites such as kool Converter or Document Converter eXPress offers an online conversion to PDF as well.</p>\n<p>    *<br />\n      To extract images from PDF, Some PDF Images Extract is a good choice. You can extract all images from several PDF files by batch or pull images from selected pages in a PDF file. Images can be saved in jpg, bmp, png, tiff, gif or tga formats.</p>\n<p>    *<br />\n      PDF-XChange ViewerTo annotate PDF documents, most of the tools do not support it, but PDF-XChange Viewer does it. PDF-XChange Viewer also allows highlighting, crossing or underlining text; drawing shapes; stamping and filling up PDF forms with a built-in typewriter. It is surprisingly more than a viewer!<br />\n\t  <a href=\"http://www.docu-track.com/PdfVwrSample.PNG\"><img decoding=\"async\" src=\"http://www.docu-track.com/PdfVwrSample.PNG\" width=200 alt=\"[image]\"></a></p>\n<p>      For Linux users, Okular is a good choice. It allows for annotations, highlighting, drawing lines and shapes, adding textboxes and stamps, selecting and saving a part of documents as text or in an image format.</p>\n<p>    *<br />\n      To make fillable PDF forms, PDFescape is a helpful web application which lets you create a PDF form online. Right from your browser, you can fill up a PDF form or create a fillable PDF form easily. You can also add text, links and sticky notes, whiteout contents and draw basic shapes. Free account users are limited to a maximum file size of 2 MB or 50 pages per file.</p>\n<p>    *<br />\n      To set viewer preference and metadata, BeCyPDFMetaEdit is a good find. It allows editing most metadata, customizing viewer preferences, slide show, page labels, etc. Tweak PDF is another choice with a simple user interface but without slideshow setting and some other features.</p>\n<p>    *<br />\n      To recover forgotten password, try PDFCrak which runs on Linux or DOS (the version for DOS is available for download here). The only supported usage of this software is to recover passwords and/or content that you own but have lost access to as stated in the FAQ.</p>\n<p>    *<br />\n      To do other functions such as to add attachments to PDF, try PDF Bundle; to compress a PDF file, try Free PDF Compressor or follow this method mentioned in our Freeware Forum.</p>\n<h2>四、其他软件</h2>\n<p>The following free applications offer certain functions and some of which are available to those reviewed. They were brought up in comments here or noted from other sources. I am listing them here with brief descriptions and links to the related sites for ease of reference.</p>\n<p>    * pdfsam (basic) allows you to split or merge your pdf documents, mix alternate pages, rotate pages of selected files, visually reorder pages of a selected pdf document, etc.<br />\n    * Sheel Khanna&#8217;s PDFTools allows for users to join multiple PDFs, split or re-arrange a PDF, encrypt or decrypt and stamp a pdf. It includes a tool to convert XML to PDF file as well.<br />\n    * Gios PDF Splitter And Merger allows merging and splitting of documents with drag and drop features.<br />\n    * GUI for PDFTK Another GUI for the multi-platform PDFTK for merging, splitting pdf files together with other various functions.<br />\n    * PdfMerge allows merging and splitting of documents with bookmark import.<br />\n    * Free PDF to Word Doc Converter  converts pdf to doc.<br />\n    * Free PDF to Word Converter converts pdf to doc or rtf.<br />\n    * PDF Watermark Creater adds a text as watermark.<br />\n    * SpeedPDF Stamp adds an image as watermark.<br />\n    * SpeedPDF Page Numberer allows adding page numbers with variable formats.<br />\n    * Freeware pdf Unlocker allows for removing PDF restrictions on printing, editing and copying text.</p>\n","protected":false},"excerpt":{"rendered":"<p>本计划纯翻译《最佳免费PDF工具软件(via)》，但发现内容有很多可改进之处，故改为编译。鸣谢：techsup [&hellip;]</p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":["1 文本办公","PDF","未分类"],"tags":["PDF","all"],"_links":{"self":[{"href":"https://xbeta.info/wp-json/wp/v2/posts/1045"}],"collection":[{"href":"https://xbeta.info/wp-json/wp/v2/posts"}],"about":[{"href":"https://xbeta.info/wp-json/wp/v2/types/post"}],"author":[{"embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/users/2"}],"replies":[{"embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/comments?post=1045"}],"version-history":[{"count":0,"href":"https://xbeta.info/wp-json/wp/v2/posts/1045/revisions"}],"wp:attachment":[{"href":"https://xbeta.info/wp-json/wp/v2/media?parent=1045"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/categories?post=1045"},{"taxonomy":"post_tag","embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/tags?post=1045"}],"curies":[{"name":"wp","href":"https://api.w.org/{rel}","templated":true}]},"wp_type":"post"}