{"id":1367,"date":"2011-12-29T17:47:19","date_gmt":"2011-12-29T09:47:19","guid":{"rendered":"http://xbeta.info/?p=1367"},"modified":"2011-12-29T17:47:19","modified_gmt":"2011-12-29T09:47:19","slug":"evernote-inc","status":"publish","link":"https://xbeta.info/evernote-inc.htm","title":{"rendered":"[精] Evernote 和 CEO Libin 的创业故事: Inc年度公司报道"},"content":{"rendered":"<p><strong>说明：</strong>关于Evernote的报道多但不够深入，介绍其创始人的文章则更少——因此，本篇文章极为珍贵，<b>推荐仔细阅读</b>。在 Evernote 被 Inc 杂志评选为2011年度公司后，Inc网站发布了此文，详细介绍了<strong> Evernote CEO Phil Libin 的个人经历、创业经过</strong>，以及 <strong>Evernote 原团队的情况</strong>，以及<strong> Libin 如何与他们走到一起，Evernote 如何克服困难，一步步发展壮大，他们的终极梦想</strong>。当然，最重要的是，读完文章，你会<strong>更深刻地理解 Evernote 所坚持的信念、文化。</strong></p>\n<p>原文：<a title=\"Evernote: Company of the Year\" href=\"http://www.inc.com/magazine/201112/evernote-2011-company-of-the-year.html\" target=\"_blank\">Evernote: Company of the Year</a>  by David H. Freedman<br />\n译文：<a href=\"http://www.webapptrend.com/2011/12/1148.html\" target=\"_blank\">Inc. magazine年度公司Evernote: 小小记事本如何风靡全球</a> by ling<br />\n转载：Evernoter.com 及 xbeta.info 对译文的转载，已获译者许可。</p>\n<p><img decoding=\"async\" title=\"Evernote 被 Inc 杂志评选为2011年度公司\" src=\"http://ww2.sinaimg.cn/large/46dac66ftw1doha6jibllj.jpg\" alt=\"Evernote 被 Inc 杂志评选为2011年度公司\" width=\"480\" height=\"360\" /></p>\n<h2>曾在失败边缘</h2>\n<p><strong>Phil Libin</strong> 还记得他将童年落在身后的那一刻。这大概是四年前，那时候他的互联网公司集资失败。那时候的他，35岁。</p>\n<p>这个公司曾经给他带来了无数喜悦，直到集资失败的那一刻。在凌晨三点，因为资金耗尽，他已经无助地等了很久，等待一个风险投资家或者天使投资或者一个CEO或者任何一个人来回应他绝望的请求，但是什么都没有等到。他知道他需要关闭Evernote，一个帮助人们记住事情的软件应用。“我意识到我将在明天早晨醒来，然后解雇公司里的每一个人。”他说。</p>\n<p>筋疲力尽士气低落的他正准备伸手去关上灯的开关，突然他的邮件提醒响了。他心中瞬间升腾起希望——但是，不，只不过是一个粉丝的消息而已，最近他已经看过太多这样的消息。这个消息是来自于Sweden的一个人，一个同行的软件企业家，他发的消息和往常的粉丝发的消息一样，不过是“Evernote改变了我的生活”诸如此类。Libin差点就错过了消息的最后一行：“如果你需要资金的话，可以联系我。”</p>\n<p>Libin稍微有些清醒了，他很快回复：“我们现在正好需要一些资金。你能提供多少？”</p>\n<p>回复立刻就来了：“50万美元够吗？”</p>\n<h2>Evernote是什么？</h2>\n<p>现在，这个公司已经拥有了来自于风投和本身利润的上亿资金。Evernote收购了一些公司，每一年的规模都扩大三倍，每天还吸引着40,000新用户。如果你生活在硅谷或者东京，这些地方Evernote为大多数人所崇拜，上面说的关于Evernote的故事不会让你感到惊讶。但如果你不是在这些地方生活，你一定会惊奇：天哪，Evernote到底是什么？</p>\n<p>Libin对<b>Evernote有多种方式的解读：</b>它是一个你卸载到服务器上的大脑。它是你的生活的Google引擎。它是你的个人小宇宙茫茫无边黑暗中的一点火花。它是一个工具，能将你的智能手机从一个时间杀手转换为帮助你节约时间的工具。</p>\n<p>好了，似乎Evernote有一点难以解读——你需要了解它才能意识到它带来了怎样颠覆性的影响。你会觉得Libin也是难以解读，这个团队里其他的经理也一样难以解读——他们是来自于很多初创公司的一群人，他们创建的公司是关于记忆方面的。这个公司的员工可以在宽敞的办公室里欢蹦乱跳，他们的会议室都是以视频游戏命名（他们可都是成年人）。这个公司的<b>客户是如此忠诚，以至于他们愿意为原本可以免费得到的服务付费</b>。这个公司正在改变学校里面孩子们的学习方式。<b>这个公司正着眼于去影响十亿人的生活</b>——这个目标正一天一天变得现实。</p>\n<h2>Libin的故事，及三次创业</h2>\n<p><strong>这样高远的目标</strong>在Libin家1979年刚刚从苏联搬到纽约波士顿的时候看起来似乎是很荒谬的。Libin那时候才8岁。14年后，他雪洗了因为只差一门课而没有拿到学士学位的耻辱。“我是我的家族中200多年来第一个没有学位的人，不会玩乐器，也不是一个国际象棋大师。”Libin说。不管他不会做的事情有多少，这些不会做不过是从另一面以一种艺术的形式证明了他的成功。</p>\n<p>学位算什么——Libin会编码。他高中时代就读于著名的纽约Bronx高中，那时候，他就是个电脑迷，并且凭借这方面的才能在自己16岁的时候就开始挣了很多钱。从大学退学以后，Libin被ATG雇用了，ATG是一个位于Cambridge, Massachusetts的公司，这个公司有很多天才的员工，他们开发出的产品很多都成为了电子商务领域的技术标准。“这是我第一次觉得什么事情都是公平的。” Libin这样说道。三年后，在1997年，他离开了ATG，和几个一起离职但是很勤奋的同伴一起创建了Engine 5公司，这个公司位于Boston，开发电子商务软件。“我是代码最差的人，所以我来做了管理工作。”Libin说。他们那时还不知道怎么去挣钱，只是沉浸于写代码中。2000年，这个公司卖了26，000，000美元。</p>\n<p>下一年中，Libin将Engine 5的核心成员聚集到一起，想要创建另外一个公司。得到MIT的电脑科学家Silvio Micali的加盟后，Libin将公司CoreStreet定位到为政府以及经济机构开发高科技安全系统上去。然而，习惯了互联网世界的高效与自由以后，Libin发现政府采购中的官僚主义和长达几年的开发周期让人无法忍受。2006年，他离开了CoreStreet，这个公司在三年后卖了20,000,000美元。尽管这次经历不太让人满意，但在这次经历中，Libin相信他的团队会是一个完美的团队。曾经工作于CoreStreet的Micali最终回到了学术界，他和Libin有着相同想法。“这个团队中的人都很有天赋，很有创造性，也非常有趣，”他说，“你一定会喜欢Phil的，他不仅有很多很有创意的想法，还能在任何事中都找到有趣的部分。你在他周围会一直都很开心。”</p>\n<p>Libin立刻着手创建第三个公司。有了前两次的经历，Libin已经清楚地知道两件事情：他不喜欢枯燥无味的东西，他不只是想要赚钱。“十亿美元不算什么。” Libin说，他这样的说法和Sean Parker曾经告诉过Facebook的Mark Zuckerberg的话完全不同。“真正了不起的是去影响十亿人。不管我最终做成了什么，我希望人们能为之激动。我希望做出一个有丰富内涵的东西。”</p>\n<p>有一个想法已经在他的脑海中出现一段时间了：我们是如何记住事物的呢，比如说一个饭店的名字？这在很大程度上依赖于我们脑海中与之相关的一些事物。比如说我们听到这个饭店的名字时正和谁一起，那时候我们在什么地方，那时候我们在做什么，或者相关的词或图片。通过这些碎片，我们就能最终想起一个被我们遗忘了的很重要的事实。但是并不是每次都能想起来。我们的大脑只有有限的记忆容量，这使得无论我们做什么，我们仍然会忘记自己经历过的大多数事情。这成了一个越来越大的问题，因为在信息时代，信息以各种形式向我们用来，信息增长的速度前所未有，而我们并不确定哪些信息是有用的。另外，婴儿潮时期出生的人现在都已年老，他们发现自己的记忆力越来越不中用了。“没有人满足于他们自己的大脑，”Libin说，“在我们的高中时代，我们的大脑就已经负担过重了。这是每个人都会遇到的问题。”</p>\n<p>我们试图通过在笔记本电脑或者平板电脑或者智能手机上分类数据来弥补这一现状。但是这一做法只有在我们不怕麻烦将信息以正确的格式存储在正确的文件正确的地方时才有效，即使我们这样做了，找到这个关键信息的位置也会是件很难的事情。这个饭店的名字是在我的笔记本电脑或者手机上吗？我可以问问那个会议上的人，就是他告诉我这个饭店名字的，但是我把他的邮件地址放哪儿了？</p>\n<p>Libin开始思考一种更好的数字化记忆会是什么样子的。你可以以任何方式表示你的信息，可以是打印的文档，可以是手写的便条，可以是照片、网页、音频文件。你可以立刻将信息存储到你的任意设备中，不必担心要如何去组织这些信息。“当人们想要捕捉到一个想法时，他们并不希望停下他们手头在做的事情。”Libin说。<br />\n更重要的是，你可以在你需要的时候立刻就找到信息，就像我们通过Google查找信息那样毫不费力，也十分直观。“Google非常好，但是它只知道公开的信息，”Libin说，“我们需要能处理私人信息的东西。”这就像是Google为你的生活建立了索引，让你生活中的信息唾手可得。更重要的是，你不要记住你需要查找的东西精确是什么。就像是你的大脑，你需要的仅仅是一个模糊的线索，比如一个人，一个地点，一个单词，一个时间。</p>\n<p>这将会产生多大的效益呢？特别是这样一个应用能在智能手机上很好地应用的时候。由于我们在办公室外做越来越多的工作，Libin意识到将我们离开电脑时的碎片时间有效利用起来的机会越来越多了。但到目前为止，大多数智能手机的应用更多是让人消磨时间而不是用来产生效益的。“它们让你在几分钟的空闲时间可以去上一下Facebook and Zynga来将时间打发掉。”Libin说，“我希望能让智能手机帮助人们在这些时间内完成工作。”最后，Libin觉得这个帮助记忆的工具一定要用起来很有趣才行。“在过去的五年里，人们一直都在致力于开发有很好用户体验的娱乐应用，但却没有人将这些经验用于开发能产生效益的工具。Microsoft Office用起来一点都不有趣。”</p>\n<p>将所有的一切结合起来，你就会明白Libin所说的“一个无处不在的生命产出平台”的含义了。现在，他要做的就是构建出这样一个产品并且让十亿人去使用它。</p>\n<blockquote><p>\n<strong>他们一路走来</strong><br />\nEvernote的很多经理都是之前和Phil Libin在Engine 5和CoreStreet共事的人。</p>\n<p><strong>1. The Friend of a Friend | 朋友的朋友</strong><br />\nDave Engberg是Brandon Volbright 的朋友，Volbright 之前在Libin的第一个公司Engine 5中工作，现在是Evernote的程序员。在Volbright引荐之后，Libin在CoreStreet中雇佣了Engberg，现在他是Evernote的CTO。<br />\n<strong>2. The College Buddy | 大学同学</strong><br />\nPhil Constantinou——或者说Phil C.，这样称呼他是为了把他和Libin区分开来。他在Stanford读大一时宿舍就在Engberg宿舍对面。Engberg将他介绍给Libin，Libin雇用他为Evernote的产品副总裁。<br />\n<strong>3. The Loyal Leader | 忠实的领导者</strong><br />\nPhil Libin的第二个公司CoreStreet是为政府开发高科技安全系统的，他决定放弃和政府签订的行动迟缓的合同。但是他还是坚持和他的团队在一起。<br />\n<strong>4. The Childhood pal | 童年伙伴</strong><br />\nAndrew Sinkov在孩童时代就认识Libin了。当Libin雇用Sinkov来帮他打理CoreStreet的市场时，Sinkov在一家房地产公司工作，熟悉市场营销的相关策略。现在，Sinkov是Evernote的市场营销副总裁。\n</p></blockquote>\n<h2>当Libin遇到Evernote</h2>\n<p>在2006年，Libin将他的人马拉到一起准备开始一个新的公司，Ribbon，含义是就在你的手指边上。（作为一个日本迷，Libin注意到这个公司名字和他自己的名字在日本有着相近发音，这对他来说是一个额外惊喜。）但是当他开始调研电子记忆产品不久，他就发现在硅谷有一家很小的开办了两年的公司叫做Evernote。这家公司生产的产品是从照片中提取文本，这样你就能通过给笔记照照片将它们转化为文字后从而可以进行搜索。“我想过这些，”Libin说，“但是<b>这些人已经在技术上走了很远了</b>。”</p>\n<p>事实上，这个Evernote团队之前为Apple富于远见而又命途多舛的个人信息管理设备开发过一些关键软件，<b>这个设备名字叫做Newton</b>，在80年代晚期出现，类似于初级的iPad。这个团队主要是由来自于俄罗斯的一群很有天赋的程序员组成，但是和Libin的团队不一样，这个团队是由一个很聪明的技术人员Stepan Pachikov带领的。Libin飞去见Pachikov，并建议<b>他们合并到一起而非互相竞争</b>。Libin成为了这个公司的CEO，公司仍然保留着Evernote的名字，而Pachikov则逐渐将他的中心转向其他的项目。</p>\n<p>Libin和他的团队搬到了硅谷，这里的文化更为不落俗套，有着高科技创业风格，而这是之前再Boston不曾有过的。在两个团队合并到一起以后，这个新的公司的资金可以支持大约一年。这足够让一个产品运行起来，如果每个人都齐心协力的话。为了达到这个目的，<b>Libin砍掉了Pachikov的团队一直以来在做的大多数项目</b>，以便集中力量开发这个革命性的助记产品的关键特性：可以获取任何形式的信息，简单的关联检索，和智能手机超级友好，使用起来很有乐趣。</p>\n<h2>新的 Evernote</h2>\n<p>2008年，公司发布了一个“个人测试”版本，主要提供给硅谷内的人使用。发布前夜，在凌晨三点——这显然是他产生他的关键想法的时间——Libin意识到他们还没有为Evernote写过任何形式的使用手册。所以Libin口述了一个演示并传到了YouTube上。“我极度担心，”他说，“我的声音被说成是世界上最枯燥无味的声音。”这个视频最终获得了超过一百万的点击量。</p>\n<p>这个助记新应用的名声在硅谷不胫而走。这或多或少和Libin之前所预见到的一样。大多数信息都可以很快添加到Evernote中，不管信息是来自于电脑还是智能手机。你可以输入一则记事，或者在触摸屏上手写一则记事，或者用手机拍照，或者记录一个语音对话，或者输入一个网址，保留这个页面的部分或者全部信息，或者将邮件推送到Evernote。这些信息会可靠地存储在Evernote的服务器上，也会存储在你自己的电脑上。这个系统也会给进入的数据加上标签信息，比如添加时间，添加时你所处的位置。多亏Pachikov团队之前开发的软件，任何照片中的可见文本都可以被搜索到。“在我去超市之前，我会将妻子贴在冰箱上的单子拍个照。” Daniel Kuperman说。他是Aprix Solutions的CEO，也是Evernote的一个早期使用者。（Aprix Solutions是一个致力于帮助企业管理营销策略的公司。）</p>\n<p>你可以为记事加上名字或者标签，但这都不是必须的。你也可以将记事归档——任何Evernote中的信息都会是来自于不同记事本的记事——并且将这些记事本或者个人记事与其他人分享。为了在之后找到你的记事，你只需要回忆起关于它的一个关键点就可以了。想要想起去过的酒店？搜一下法国吐司，因为这是你在那家酒店吃过的，并且你还给菜单照了一张照片。或者搜西雅图，因为那时候你就在那儿。或者搜Janet，因为她那时和你在一起，你还给她照了一张相。或者搜黑洞，因为你记得那天你点到了一篇关于黑洞的文章，一旦你知道日期了，你就可以找到那天的其他记事了。“这是将事情放在你手边的电子版应用。”Libin说。</p>\n<p>对很多硅谷人来说，这个工具是会议上的福音。你可以在键入笔记的同时录制音频和为白板拍摄图片。所有信息都会在Evernote上整合，让你以后很容易回想起来。通过将Evernote整合到其他设备中，你还能有更多找到事物的方式：录音可转录（需要支付额外费用），以便让你可以通过会议上说的东西进行搜索，一个附加工具甚至可以让你通过颜色搜索照片——如果你关于某次会议记得的只是一个同事穿的橘色毛衣，你也能找到这次会议相关的信息。“Evernote查找事物的方式和你的大脑工作方式一样，并且给了你越来越多的记忆关联。” Andrew Sinkov——Libin的儿时好友这样说到。他之前在CoreStreet工作，现在领导着Evernote的市场营销。</p>\n<p>难怪硅谷人都很喜欢这个工具——这些人都是在身陷信息海洋的人。“生活中会发生如此多的事情，这让我有越来越多的数据。” Jason Freedman说。他是Evernote的一个早期爱好者，同时也是FlightCaster的联合创始人。FlightCaster提供基于网络的差旅信息服务。“Evernote之于我的生活就像是Container Store之于我的卧室，”他说，“它让你的神智能很快反应过来。”</p>\n<h2>新 Evernote 如何发展？</h2>\n<p>尽管Evernote的Beta版本在2008年中期推出以后受到了热烈欢迎，公司资金消耗得很快，Libin尽力去筹集更多资金。然而风投们都有所担心。作为一个新公司，当硅谷在试图寻找下一个Facebook之时，Evernote并没有做社交网络。此外，当大多数人认为任何事情都要迁往云端时，Evernote却逆潮流而上。它是基于本地应用的——运行在电脑或者智能手机上的软件做了大多数工作，而不是某个网络上的服务器。尽管这个应用有一个Web版本，但是Evernote更多是作为本地应用来运行，因为它在本地运行起来更快。Libin坚信对于一个助记应用来说快速反应是非常关键的。</p>\n<p>还有另外一个担心，这也是主要担心所在。Evernote提供的是一个免费增值服务。换句话说，人们要么使用一个免费版本，要么使用付费增值版本，这就是公司盈利模式。到目前为止，一切都还好，免费版本看起来就是个很好的版本。问题在于，不像其他真正依赖于这个模式盈利的公司，Libin拒绝限制免费版本，使得人们转用升级版本动力不足。你可以每月付5美元以便获得更多的文件存储空间，但是有谁会这么做呢？免费版本功能全面并且提供了很慷慨的空间。</p>\n<p>Libin解释他的理论说：<b>你在Evernote中放的东西越多，Evernote对你就越重要</b>。谁会舍不得付出5美元给一个存储着你的记忆并且帮助你回忆起它们的公司呢？“你的记事，你的酒店，你的朋友，你一年的生活，然后是你的一生，”Libin说，“这价值千万。”危险不是人们不愿升级，而是他们不想先去试用这个服务或者因为免费版本的低劣而不用继续试用这个服务。让他们爱上这个服务，他们最终就会为之付钱的，因为他们会为了这个服务的成功而投资。“我想建立一个能流传百年的公司，我是认真的。”Libin说。“<b>我不需要现在搜刮你的钱财，我只需要留下你的余生来让你付费</b>。这是一个长期的策略。我们的信条是，‘与其让你付费，不如让你留下来。’我希望有一个<b>优雅的商务模式</b>”</p>\n<p>风投不为所动。“没有人愿意联系我们。”Libin说。绝望之下，Libin转向欧洲并和那里的一个投资公司签订了一个10,000,000美元的协议。这个协议本该在2008年十月完成，最终却砸在了一次股票市场上最为严重的崩溃之中，投资者取消了协议，双方都十分惋惜。</p>\n<p>Libin找不到另外一个投资者，在这股市崩溃后的混乱中，甚至没有人回他的电话。他意识到自己只能关闭公司了。就在这时，那个瑞典人提供了50万美元。Libin现在有大约六个月时间来证明他的关于挽留用户比让用户付费更重要的理论了。“这就是一切开始发生的时刻了。”Libin说。</p>\n<h2>转机出现</h2>\n<p>在2009年中期，Gary Little，一个摩根泰勒（Morgenthaler）投资公司的人以及一个在硅谷很有影响力的人物，收到了来自于斯坦福教授Guido Appenzeller的一封邮件。Guido Appenzeller现在正和风投公司合作，以便推出他的第二家公司。“Guido说我一定要看看这个像风暴般席卷了斯坦福的热门新应用。”Little回忆说。Little自己试用了一下这个应用，对其印象深刻，并请来了这个公司的CEO——他现在正在想办法筹集资金——来商谈投资。这个CEO十分放松，亲切，谦虚，并且他很快用他的幽默让所有人哄堂大笑。这个人说他之所以选在现在的商务策略是因为这个策略十分优雅。他的国际战场主要集中于日本是因为他喜欢日本的食物。</p>\n<p>在随后的一次会议上，Libin让投资公司的人大为惊叹，他展示了一系列幻灯片，被Little称为是“我所见过的最好的商业分析”。Libin展示了试用Evernote一个月的用户选择升级到付费版本的比例，为0.5%。这显然不太好，不过也在意料之中，因为免费版本使用起来就很好。但接下来Libin展示了试用Evernote更长时间以后的用户选择升级的比率。通常而言，这个比率会更低，因为对于大多数采用免费增值盈利模式的公司来说，用户都会很快选择升级。他们试用了有某些限制的免费版本以后，如果他们喜欢这个产品，他们就会立刻升级以便获得完整版本；如果他们不是太喜欢，他们就会选择放弃这个产品或者只是使用其最基本的功能。但Libin展示的数据却显示出随着用户使用免费产品的时间增加，他们会更愿意升级到付费版本。对那些使用Evernote长达一年的用户，升级比率已经达到了令人可喜的8%。如果Evernote能获得100万用户，Evernote的销售额就会达到每年四百万美元。但是，照目前的增长率来看，Evernote将会在两年内获得1000万用户。</p>\n<p>然后Libin展示了用户活跃度，或者说，一个用户随着时间增加使用Evernote的平均时间。对于很多软件公司来说，这个曲线通常无情地呈现出下降趋势。很多人在试用一个应用以后会很快放弃它或者随着时间增加使用频率会越来越低。但是对Evernote来说，这个曲线却仿佛一个微笑。在最初的几个月里，会有一个轻微的下降，但曲线很快就上升了——不仅是因为活跃用户越来越发现这个服务有用，还因为曾经停止使用这个服务的人又回过头来使用它了。曾经放弃过Evernote的人都十分想念这个这个应用。</p>\n<p>Morgenthaler对其进行了投资。接下来硅谷的另外一家顶级风投公司Sequoia Capital也进行了投资。接下来是其他的一些风投。Evernote总共筹集到95,000,000美元。“我们用不了这许多钱，”Libin说，“但这是你应该得到这些钱的时候了，所以我们接受了。”Evernote要不了这许多钱是因为公司在2011年初期已经开始盈利了，就在获得1000万用户之前，其年度销售额达到了16,000,000美元。</p>\n<p>现在，这个公司坐落于加利福利亚Mountain View中一个广阔通风、色彩绚烂的地方。公司布局给人感觉十分随意，有的地方狭小，有的地方开阔，玩具和箱子散落各处。大概有80个雇员——其中有15个来自于俄罗斯——有一个开发团队在莫斯科，另外在东京还有一个办公室。当Libin出差时，在办公室里有一个打眼的机器人代表他，这个机器人装着轮子，还有摄像头和激光探头，Libin通过笔记本来控制它。当Libin出现在办公室的时候他看起来就像是咖啡馆的吟游诗人，手上端着咖啡四处晃荡，展现出令人尊敬的样子，他脸上的特征似乎就是为了展现出他那令人尊敬的山羊胡。</p>\n<h2>Evernote 成功的秘密</h2>\n<p>这个公司已经拥有了超过15,000,000用户，并且用户数目还在以每月50万的速度增长，而这个公司并没有太多营销人员。Evernote并没有费力去让人们为其付费，这也是它如此流行的原因之一。“<b>当你不再试图让人们向你付费的时候，你的目标就改变了</b>，” Sinkov说，“我们的目标是公益的，而非营利性质的。<b>我们需要做的只是告诉人们Evernote可以做什么。</b>”</p>\n<p>这样一个天才的不去做营销的策略，到目前为止已经带来了了不起的销售量。长期的增长率预期可以持续到三年以后，达到15%。新的用户会按照这样一个比率去升级吗？Kuperman，一个企业家以及一个Evernote的早期使用者，认为Evernote采用了正确的方式。“人们最终会觉得他们需要为这样一个伟大的产品付费以表示感谢，”他说，“Evernote也不需要为市场营销花太多钱。我每次使用Evernote的时候，有人问我在做什么，我就会告诉他们，然后他们就会试用它。我在为Evernote做营销。”</p>\n<p>Libin说他不曾担心过的一件事情就是竞争。并且在实际上，也几乎没有可以与其竞争的产品或者服务。其中稍微引人注目的是微软的OneNote，它有一些相同功能，并且和Microsoft Office一起使用。但是，它不像Evernote这样便捷，可以在任何设备环境下提取任何类型的记事，它也就不如Evernote那样具有吸引力。当然，在未来会有更多更好的竞争者出现。当这种情况发生以后，Evernote的用户可以毫不费力带着他们存在Evernote中的数据离开，因为<b>Libin坚持让Evernote中的信息可以很容易带走，这样就不会有人觉得被捆绑到这个服务上了</b>。“在苏联曾经有这样一句话：‘<b>任何一个可以让你自由离开的国家也正是一个可以让你自由居住的国家。</b>’我希望我们的用户可以自由离开。”</p>\n<h2>Evernote在新兴市场</h2>\n<p>Libin没有固守住公司现有的市场，而是试图向新市场进军。“在泰国，明年将会有数百万人使用智能手机。” Dave Engberg说。他是公司的CTO，是另外一个来自于CoreStreet的人。日本对于这个公司来说是一个十足的胜利，日本的用户占Evernote用户群的20%，而在美国的用户占据的比例是35%，并且日本用户平均比美国用户活跃两倍。“<b>在日本有一种整理分类的文化</b>。” Hitoshi Hokamura说，他现在带领着公司的日本部分。</p>\n<p>Evernote现在在东京就仿佛是一种邪教。<b>书店有专门的Evernote专区</b>——在Evernote上，有大约32本日文书籍——当Libin在东京的时候，他有时候会在街上被粉丝们拦住。NTT Docomo，日本最大的手机服务提供商，为Android手机用户免费提供Evernote的优质服务，这吸引了很多人。（Docomo的风投团队在Evernote投资了200万美元。）在世界上的其他地方，使用Evernote的人和智能手机的增长几乎是一致的。这预示着在接下来几年中，Evernote的全球增长曲线将会十分陡峭。</p>\n<p>另外，围绕着Evernote形成了一个产品和服务的生态系统。电脑，手机，平板电脑、打印机以及扫描器都有集成Evernote功能的，有时候只需要通过一个专门的Evernote按钮就可以。（这并不很难做到因为很多世界顶尖的电子产品供应商总部都在日本。）当你拿出你全新的HTC平板电脑，启动电脑以后它立刻会问你是否需要注册到Evernote。大概有6000个软件开发者已经或者正在将他们的应用和服务和Evernote整合到一起。</p>\n<p>出于一种特殊的敬意，波士顿大学将Libin列为其杰出校友，尽管他根本就没有毕业。Libin对此不置可否。“我将会是历史上第一个获得荣誉学士学位的人。”他说。这比国际象棋和小提琴更容易。</p>\n<h2>Evernote的终极梦想</h2>\n<p>现在，Libin 正在认真考虑将Evernote做成一个<b>能持续100年的公司</b>。他在努力思考如何在人们口味快速变化的网络应用时代让人们持续喜欢Evernote。他相信，答案中肯定有一部分是——让公司做的产品不只是人们记忆事物的一种方式。“我们想<b>将一个应用扩展成一族应用，这些应用都跟记忆有关</b>。”他说。“我们用来测试一个产品是否要做是问一个问题：是否会有一亿人会立刻用这个产品。”今年，这个公司发布了他的第二个产品，Evernote Peek，这个产品是一个iPad应用，可以将这个平板电脑转化成供学习使用的闪存卡系统。这在一夜之间成了最流行的具有教育功能的iPad应用。（初中学校开始对Evernote变得狂热，很多提供电脑给学生的学校都装上了Evernote——开始记录学习时代的记忆永远是赶早不赶晚。）</p>\n<p>未来会有更多产品。这个公司在九月宣布将在Austin开一个工作室——“工作室”是借用了游戏产业的一个名词，意味着相对独立的开发新游戏的工作室。Libin说他将遵循工作室的模式。“这将会是一个本地的小组，他们开发出的产品都是让他们觉得骄傲的。”Libin计划在新加坡以及欧洲的某个地方开更多工作室——前提是他有时间到各地品尝事物从而做出他的决定。</p>\n<p>在长期计划上，Libin想要确定如何更多去帮助人们记忆、学习、理解以及交流。注意到图片比文本更能唤起人们的想法，他设想<b>将来Evernote能识别照片中的物体和人脸，甚至有一天能识别气味。</b>“你自己的大脑，”Libin说，“可能是你最后想要去搜寻信息的地方了。” （完）<br />\n</iframe></p>\n","protected":false},"excerpt":{"rendered":"<p>说明：关于Evernote的报道多但不够深入，介绍其创始人的文章则更少——因此，本篇文章极为珍贵，推荐仔细阅读 [&hellip;]</p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":["1.4 信息管理","未分类"],"tags":["Evernote","all"],"_links":{"self":[{"href":"https://xbeta.info/wp-json/wp/v2/posts/1367"}],"collection":[{"href":"https://xbeta.info/wp-json/wp/v2/posts"}],"about":[{"href":"https://xbeta.info/wp-json/wp/v2/types/post"}],"author":[{"embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/users/2"}],"replies":[{"embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/comments?post=1367"}],"version-history":[{"count":0,"href":"https://xbeta.info/wp-json/wp/v2/posts/1367/revisions"}],"wp:attachment":[{"href":"https://xbeta.info/wp-json/wp/v2/media?parent=1367"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/categories?post=1367"},{"taxonomy":"post_tag","embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/tags?post=1367"}],"curies":[{"name":"wp","href":"https://api.w.org/{rel}","templated":true}]},"wp_type":"post"}