{"id":389,"date":"2008-05-09T07:55:05","date_gmt":"2008-05-08T23:55:05","guid":{"rendered":"http://xbeta.info/?p=389"},"modified":"2008-05-09T07:55:05","modified_gmt":"2008-05-08T23:55:05","slug":"dictionary-review","status":"publish","link":"https://xbeta.info/dictionary-review.htm","title":{"rendered":"桌面词典软件07年终点评（转载）"},"content":{"rendered":"<p><img decoding=\"async\" class=\"alignleft\" style=\"float: left; margin-left: 10px; margin-right: 10px;\" src=\"http://img522.imageshack.us/img522/1060/dictes8.gif\" alt=\"翻译工具\" width=\"188\" height=\"105\" /><span style=\"color: #006699;\">※感谢作者<a href=\"http://www.newsmth.net/bbsqry.php?userid=Ravanelli\">Ravanelli</a>许可善用佳软转载。<br />\n※ 善用佳软提倡使用正版或免费软件。本文中Lingoes、有道词典、雅虎乐译，及本文未曾介绍的StarDict为免费软件。尽管，Lingoes含<a href=\"http://soft.72pines.com/lingoes/\">广告且强制升级</a>，也可能与StarDict一样，存在词库版权疑问。</span></p>\n<div><strong><span style=\"font-weight: bold;\">序言：桌面词典软件07年终点评</span></strong></div>\n<div>作为一个每天用8个小时阅读和捏造各色英文paper、另8小时挂在网上到处神游、剩下8小时全部用来睡觉的典型学术宅男，随时都可能被paper中 生僻的单词和网上层出不穷的怪异新词缩写噎得目瞪口呆。无奈本人生平最怕翻大部头词典，直到现在大一时被英语老师忽悠买的《朗文英汉双解词典》除了拍死过 宿舍桌上小强的页面有些发黄外，基本还跟新的一样（俺生平最喜欢的词典是中学刚学习英格力士时那种可以装在兜里的小单词本和文曲星-_-!!!），所以自 从接触了电脑以后，发现在电脑上查询单词简直是非常方便，尤其是在进入T大一个天天要跟电脑打交道的系之后，电脑上的桌面词典就成了我的装机必备软件。前 后数数这几年，从最初的单机词典到专业词典再到现在上网必备的在线词典，到今天为止我已经使用了不下十款各种词典软件。作为一个在新软潜水多年的资深潜水 员，俺也赶个时髦，试着写一篇桌面词典软件的年终点评，希望能给各位一点帮助。</p>\n<p>因为我平时使用Linux比较少，类似Stardict之类的词典没怎么用过(现在也出for windows版本了），我主要涉及的是Windows下的几款桌面词典：金山词霸2007（它家还有一个金山豆豆，但各家我只点评一个最经典的，所以省 略）、babylon、有道桌面词典、雅虎乐译和灵格斯。桌面词典软件对系统没有太高要求，尤其是在现在硬件价格白菜化的大背景下，随便一个机器就有上百 G的硬盘和差不多1G左右的内存，机器配置早不是什么问题了。不过因为随着机器联网的时间越来越长，以及使用和体积上的优势，用在线词典已经成为新的趋 势，当然一个良好的网络环境是必须的，否则很多好玩好用的功能就无法体验到了。</p>\n<p>一般来说，对于一款桌面词典，我认为需要考察的是这几个方面：安装方便、界面友好性、操作方便与否、词库种类和容量大小、支持语种多少、翻译质量、响应 速度以及其扩展能力如何等，当然还包括它有什么能打动我的特色功能。做到每一项都完美的桌面词典，我觉得还没有诞生，而且我觉得这辈子也看不到了……这当 然只是一句玩笑话，因为我们普通用户的需求是不断增加和改变的。那既然是个人点评，我下面的评测也主要来自实际使用和观察，总的来说是各有千秋，萝卜白 菜……好了，闲话不多说，点评开始……</p>\n</div>\n<div><span style=\"font-weight: bold;\">一、金山词霸2007：廉颇老矣，尚能饭否？</span><br />\n<img decoding=\"async\" style=\"margin: 4px; float: left;\" src=\"http://cp.iciba.com/image07/cplogo.gif\" alt=\"图\" /> 相信很多人和我一样，在电脑上看到&#8221;糍粑&#8221;这个词立刻就想到&#8221;词霸&#8221;，有时候我甚至回忆不起到底是先有的&#8221;词霸&#8221;还是&#8221;波霸&#8221;这个称谓……金山词霸是我 接触到的第一款桌面词典，在基于网络和搜索技术的在线词典出现之很久很久以前，几乎所有人都使用过金山词霸单机版的桌面词典（正版或者盗版），这款词汇量 丰富、功能齐全的软件称得上是这一领域的一座里程碑，一度成为每台电脑居家必备的装机软件，其提供的功能也成为了这一领域的行业标准。//掌声感谢一下！<br />\n当然，金山词霸并不是免费软件，不然每年为啥都要升级一次版本号呢。正版的2007专业版要一百多块钱，尽管看版上有人说过最低可以49块搞定，不过对于俺这种打死也不为软件交一分钱的人来说，这个价钱还是太贵了-_-<span style=\"color: #ff0000;\">(善用佳软注：相信作者不会一直这样的)</span> 好在网上可以找到很多D版的，只是自从词霸2006之后破解麻烦了不少，而且在网上也常看到有人说在Vista下常会出现各种运行导致崩溃的兼容性问题 （最近好像2007的破解常被norton给干掉，不过我用的是卡巴斯基，还没出现什么问题，吼吼）。我装的是金山词霸2007SP1龙卷风版，安装过程 比较简单，占用空间400Mb左右，占用空间比较多也是单机版桌面词典所不得不面对的一项劣势。如果你觉得400MB无非就是一部武藤兰，那么换来的大词 库还是很值得D~~~<br />\n作为一款堪称&#8221;行业标准&#8221;的词典软件，金山词霸2007在界面布局方面没有太大变化，只是去掉了一些不必要的功能，显得比以前更清爽了些。2007提 供了主界面查询和鼠标取词两种查询手段。不得不说，金山词霸的鼠标取词功能是我用过的词典中效果最不错的，响应速度比较快，能很好地支持PDF、 WORD、网页文本等格式。<br />\n金山词霸2007收录了150余本权威词典辞书，70余本专业词库，还收录了与朗文、牛津、韦氏齐名的四大词典之一的《美国传统词典》，支持中英日文 查词功能，除了提供基本词义、常用词组、语源、继承用法等内容，2007还提供了比较丰富的例句功能。金山词霸的词库全部保存在用户硬盘中，所以查询响应 速度很快，此外，2007中还提供了生词本和迷你背单词两个小工具。<br />\n当然，金山词霸的响应速度快是靠着将词库保存在本地实现的，这也就意味着金山词霸会占用你更多的硬盘空间（空间换时间，呵呵），另外，由于金山词霸是 基于传统词典内容的一款词典软件，它提供的词典数量虽然巨大，但这些词典是不会时常更新的，所以它对最新的一些英文名称、缩写和网络新词几乎没有什么翻译 能力，比如当我想要查询Orz是什么意思或者CPC、CPM是什么词语的简写时（CPC倒是可以查出代表****党，可是我想要的&#8221;点击成本&#8221;的解释，词 霸是给不出来的，因为这是一个营销新词汇），就成了不可能完成的任务！显然，已经有十年历史的金山词霸已经注意到了自己的这个劣势，所以在2007版本中 加入了一个网络查词功能，实际上就是链接到金山的爱词霸网站进行所谓的网络查询。不过经过我的测试发现这个爱词霸网站就是一个金山词霸的在线版本，也就是 说在本地查不到的，指路去爱词霸，但是爱词霸后台查的还是金山词霸，等于绕一圈又回来了。我唯一觉得有希望的，是那个新板块叫做&#8221;爱心词典&#8221;，大概就是 wiki的意思吧，由网友手动添加和自行更改解释。不过查了几个词，目前效果不算好，我想是因为热心网友的水准也并不一样而导致的问题。作为词典软件的老 大哥，对金山词霸真是有点爱恨交加，希望能跟上最新技术的脚步吧。<br />\n<span style=\"color: #006699;\">综合打分：★★★★<br />\n优势点评：传统桌面词典的代表，功能完善，取词方便，词典内容丰富<br />\n劣势点评：收费软件、破解有时不好用<span style=\"color: #ff0000;\">(善用佳软注:这不是软件的缺点)</span> ，占用硬盘空间大，内存资源消耗多，词库不开放、实时性差，无法翻译最新的词汇、缩写和用法<br />\n官网地址：<a href=\"http://www.kingsoft.com/\" target=\"_blank\">http://www.kingsoft.com/</a></span></p>\n<p><span style=\"font-weight: bold;\">二、babylon：以色列的和尚会念经！</span><br />\n<img decoding=\"async\" style=\"margin: 4px; float: left;\" src=\"http://a1709.g.akamai.net/7/1709/2537/v0015/www.babylon.com/affiliates/landing/images/babylon-site-logo.gif\" alt=\"\" /> babylon是来自于以色列的一款翻译词典软件，在全球号称有70余个国家的2千2百万使用者。它最大的特点是开放词典格式和编写规则，可以允许用 户添加其他语言的词典，能使用户翻译一次得到多种语言的解释。目前babylon大有赶超金山词霸之势（或许已经超过了吧，呵呵）。<br />\nbabylon另一大特点就是一个字儿&#8211;贵-_-!!!，babylon软件本身和它的多款词库都需要花钱购买，而且动不动就是几十美刀，显然这太不符合中国国情了嘛，猪都20块一斤了，总不能不吃肉吃电子版词典吧……勤劳善良的中国人民想出了ban ip、找licenses、改系统时间、安装各种破解程序等等等等手段，让我们也能享受到这样好用的词典……当然现在这些手段越来越不好使了，免费的午餐不好吃啊~本人目前用的是Babylon v7.0.0.13. Slim（哪里还能找到6?）。其安装文件和占用硬盘空间均不大，这是因为babylon需要用户在安装完后自行添加词库（看，变着法儿的叫你交钱……），所以其占用空间大小是和用户安装的词库数量大小密切相关的，取决于用户是不是&#8221;<strong>词典控</strong>&#8220;，我有个同学就一下装了2G多的词典词库-_-!</p>\n</div>\n<div><span style=\"color: #006699;\"> xbeta注:感谢Bobo网友对“词典控”的指正。不明其义者可搜索“萝莉控”。对了，也可以试试哪个词典能查到萝莉控。</span><br />\nbabylon的界面十分简单，在绿色版安装完后只能进行在线的查阅。另外babylon没有提供查询索引功能，所以需要我们在输入的时候小心不要拼 写错了单词。babylon还提供了鼠标取词功能，能在PDF等各种文档中取词，比较神奇的是babylon号称取词功能是用了ocr技术，不过精度有待 提高，有时候会有莫名其妙的错误。babylon功能齐全，它提供了许多排版精美、来源权威的词典，甚至包括《大英百科全书》，用户可以根据需要去购买使 用（别问我，verycd上就有全套的免费词典下载），另外网上还有大量网友自制的各种类型词典，绝对可以找到自己需要的。只要你安装了足够多的其它语言 字典，翻译一次就可同时得到其它语言的翻译，例如用户的字典清单中有英英、英中、英德、英日、英韩的字典时，当查询一个英文单字时，便会同时一次给出所有 英中德日韩文的翻译。不过下载了这么多词典，硬盘空间还是有些浪费的。</div>\n<div><img decoding=\"async\" src=\"http://a1709.g.akamai.net/7/1709/2537/v0005/www.babylon.com/images/b7_hp2_blue_screenshot_eng.png\" alt=\"\" /><br />\nbabylon更吸引人的一点是它提供了wikipedia的内容，可以选择在线查询或者下载到本地进行使用（占地大了点），这对于我们这些生活在GFW 中的网民来说简直是福音啊。此外babylon还可以根据当日汇率换算货币，进行单位换算，最近babylon又推出了Mobile版本，看来 babylon已经瞄准了手机用户，有了破解版后赶紧装一个……<br />\n<span style=\"color: #006699;\"> 综合打分：★★★★☆<br />\n优势点评：词典资源丰富，支持语种众多，功能强大，支持取词功能<br />\n劣势点评：无查询索引，验证麻烦（谁让我们要用盗版的呢，呵呵）<span style=\"color: #ff0000;\">（善用佳软注:破解麻烦不是缺点）</span><br />\n<a href=\"http://www.babylon.com/\" target=\"_blank\">http://www.babylon.com/</a></span></div>\n<div><span style=\"font-weight: bold;\">三、有道桌面词典：小身材，大胃口！</span></div>\n<div><img decoding=\"async\" style=\"margin: 4px; float: right;\" src=\"http://dict.yodao.com/desktop/images/logoDict.gif\" alt=\"\" /> 有道桌面词典是最近正快速流行的一款新词典，是网易有道搜索旗下的一款桌面产品，除了提供常规的翻译功能外，有道桌面词典最爽的是可以查到那些普通字典中查不到的网络新词、英文名称和缩写，所谓&#8221;网络释义&#8221;功能，这也是其领先于单机版词典的杀手锏。<br />\n实际上有道的桌面词典推出之前，我看到同学的浏览器书签里有一个“有道海量词典”，当时点过去看，简洁的页面和其他搜索区别不是很大，不过玩弄几下之 后，海量词典的海量倒着实是让我吃惊不小。同其他词典一样，有道也提供了英汉、汉英和英英词典，它的英汉、汉英解释应用了海词dict.cn的结果，使用 起来十分方便，而英英词典则是使用了Princeton大学开发的Wordnet。这两款权威的词典保证了有道海量词典的基础释义，同时有道也提供了同义 词、反义词和短语词组的功能。</div>\n<div><img decoding=\"async\" src=\"http://www.yodao.com/help/deskdict/description/001/001.jpg\" alt=\"\" /><br />\n不过，这些功能并不是让我觉得惊艳的地方，有道词典真正的杀手锏在于其网络释义功能。我抄一段官网上的介绍好了，“网络释义是有道海量词典的一项创新 功能，通过对数亿个网页进行数据挖掘和文本分析，获取了大量存在于网络、但普通词典中查找不到的英文名称和缩写，包括很多影视作品名称、品牌名称、名人姓 名、地名、专业术语等。”简单来说，就是网络上的中文名词很多都会给出相应的英文说法，而如果相同的中英文对译在网络上出现了多次的话，就可以认为这种解 释具有一定的代表性了。试着查询了几个词，发现这个逻辑还是相当有用的，很多在词典里查不到的词在这里都可以找到。前一阵在水木上看到有人说自己是“干物 女”，一直不知道这个干物女是什么意思，在有道中查询了一下，网络释义功能就给出了“Himono-Onna”的翻译，下面还有关于这个词来源于日本的详 细解释，真的是让人兴奋。或者当你有某种需要想去bt上下载某些资源的时候，你就可以查一查Asakawa Ran和Madoka Ozawa都是谁，呵呵（这个少儿不宜-_-不过你要是想查个电影名啊人名啊什么的还是很实用的）。再举个更搞的例子，我想查灵格斯软件的英文名 Lingoes，可是不管是用金山词霸或者babylon还是乐译，甚至是lingoes自己都查不出lingoes是什么意思，可是有道的网络释义功能 却明白地给出了&#8221;灵格斯词霸&#8221;的解释，着实让我惊奇。此外，专业术语缩写的查询是我觉得另一个非常实用的功能，再也不用面对网上一堆让人摸不着头脑的缩写 抓狂了。<br />\n有道桌面词典就是这个海量词典的客户端，体积很小，最新版的只有1.13Mb，在网络条件良好的情况下，其响应速度令人满意，另外它还提供了一个大小 为1.7Mb的精简版词库，使用户可以在离线情况下进行基本的词典查询。唯一不爽的是，这个精简版词库需要另行下载，我觉得直接打包就得了，不然很折腾。 有道桌面词典同babylon一样选择了简约的界面风格，在面板左侧上提供了查询提示功能，此外因为是搜索引擎出身，所以还有查询纠错，就是类似 google那种，你把英文词打错个别拼写，它会在返回页面上说，您要找的是不是XXX，这倒是让我更懒了，呵呵。<br />\n在我刚使用有道桌面词典的时候，它是没有鼠标取词功能的，看在它好用的查询效果的份上，忍了，每次都copy&amp;paste或者自己敲进去（一 边敲一边安慰自己就当是多敲一遍加深记忆-_-！！！），不过终于还是有了忍无可忍的那一天……我大概是11月初很郁闷的给他们写了一封长信痛斥了一番， 说这么低级的工作你们都做不出来就不要混词典圈儿了。然后过了两天竟然回了一个信说感谢您的关注我们正在改进产品云云，我觉得说得很含糊很官方口气，没想 到没过几天词典竟然自动更新了，然后我又得到一封回信说感谢我的好建议，所以不知道这次取词增加和我的信有无因果关系，我才是中小词典的用户之王啊，哈哈 哈……感觉挺爽的。增加的这个鼠标取词功响应速度很快，可以在各种文档中取词，不过奇怪的是，对于PDF文件，在Acrobat Reader中取不了词，实验室机器上的Professional版本下面倒是可以，大部分用户一般不会去安装专业版的吧，如果Reader中的取词做不 到，还是很致命的……我又写了个信过去，看看是不是又能改掉这个毛病！<br />\n有道桌面词典还提供了发音功能和大量的例句，不同的是这些例句全部来自互联网，和传统词典上的例句风格不太一样，在查词的同时可以看一下这个词的用 法，还是蛮有用的。那天看人MSN昵称叫Zhuangbility，觉得很乐，也很有查询的冲动，结果在有道的基本词典部分是没查到，不过竟然找到了变态 的例句！而且都来自新东方的罗胖子！让我想起当初上G班听他课的日子来……<br />\n① One can&#8217;t deny that there is a certain degree of zhuangbility shown in his newly published yet already sold-out novel; as a matter of fact,it is the only quality that sells the book so well.  　　　他刚刚出版就已经销售一空的小说很明显带有一定程度的装逼性，对于这一点，没有人能够否认；事实上，正是装逼的特质使得这本书如此畅销。 www.luoyonghao.net<br />\n② If one claims and can prove that he or she has lived all their lives without betraying even one day his belief in zhuangbility, then we can safely conclude that the person is absolutely the first and the only symbol of niubility in human history ever!  　　如果一个人宣称他/一辈子没有一天不装逼并且能够拿出证据来，那我们就可以安全地得出以下结论：他/就是人类有史以来空前绝后独一无二的牛逼的象征！   www.luoyonghao.net<br />\n<span style=\"color: #006699;\"> 综合打分：★★★★☆<br />\n优势点评：免费小巧、强大的网络释义功能和丰富的例句用法示例<br />\n劣势点评：鼠标取词功能还需改进，本地词库需要单独下载<br />\n官网地址：<a href=\"http://dict.yodao.com/desktop/\" target=\"_blank\">http://dict.yodao.com/desktop/</a></span></p>\n<p><span style=\"font-weight: bold;\">四、雅虎乐译：我翻译，我搜索，我乐意！</span><br />\n<img decoding=\"async\" src=\"http://cn.yimg.com/i/cn/yassistant/iyahoo/ysoft/0704/ly_pic01.jpg\" alt=\"\" /> <img decoding=\"async\" src=\"http://cn.yimg.com/i/cn/yassistant/iyahoo/ysoft/0704/ly_pic03.jpg\" alt=\"\" /><br />\n雅虎乐译是雅虎公司推出的的桌面词典软件。它的特色是其宣传的提供翻译和搜索相结合的功能。<br />\n乐译1.0安装文件体积跟有道桌面词典同为1.13Mb，同样体现了在线词典小巧便捷的特点。乐译的界面有些另类，与我们习惯的翻译软件均不相同。除 了功能标签被安排到界面下端之外，还增加了一个搜索结果的窗口，里面显示的是用户所查询单词的网络搜索结果，除此之外屏幕上还会出现一个雅虎乐译的移动 笔。<br />\n<img decoding=\"async\" style=\"margin: 4px; float: left;\" src=\"http://cn.yimg.com/i/cn/yassistant/iyahoo/ysoft/0704/ly_pic02x.jpg\" alt=\"\" /> 说实话在安装雅虎乐译的时候，它最吸引我的就是这个号称智能化的<strong>移动笔功能</strong>， 当用鼠标拖动移动笔到需要查询的词上时，移动笔会自动在该词的下方划一道横线，然后弹出主界面显示查询结果，我觉得这是乐译的一个特有的比较炫的功能，不 过从实际使用效果上看，移动笔在划词准确性上还有欠缺，经常划不出我想查的词，还出现过跟其他软件冲突或者没有响应的bug。另外最致命的是移动笔功能会 使查词速度变慢，没人在阅读时愿意拖着移动笔找到单词再等着它划完线再等着看结果，这个实际使用价值远不如鼠标取词方式，有点<strong>中看不中用</strong>的意思。乐译的鼠标取词功能不支持PDF格式文档。<br />\n乐译同样提供了类似有道网络释义的功能，不过名字改成了“网络解释”（不知道是不是商标侵权的担心？），但表现没有有道好，试着查了一下 The Assembly和A Hope这两个词（都是今年的贺岁片名，呵呵），乐译给出的网络释义结果是&#8221;共同体大会&#8221;和&#8221;希望&#8221;，而有道则给出了《集结号》和《长江七号》的准确解 释，另外对于很多缩写词比如ADT之类乐译也给不出翻译，看来雅虎乐译要想在桌面词典分得一杯羹，尤其在网络释义这一块还需要继续修炼内力。乐译对于单词 给出了英音和美音的两种不同音标和发音（不过我试过几个单词听不出这两个发音有什么区别，也许是同一个发音引擎？猜的……），提供了生词本功能，还集成了 雅虎的网页翻译，但是遗憾的是乐译没有提供例句功能，也没有提供本地字库，如果断网时就没法使用了。<br />\n乐译一直宣传自己的另一特色就是将翻译和搜索结合起来，说白了就是在词库中查一个词的同时，还把这个词作为搜索关键词在雅虎搜索中搜一遍，然后给出这 个词的搜索结果和相关搜索，在搜索结果框内显示给用户。先不说这个对于查询速度会有什么影响，我还是觉得这个功能有点多余……因为用户使用词典的目的非常 明确，就好比我已经点了麦当劳的汉堡正要坐下来吃，突然服务员又过来问：&#8221;您也许还想吃碗炒肝？&#8221;不排除有人喜欢就着炒肝吃汉堡，有这个需求，但是我觉得 这并非一个最通常的操作逻辑。这也是很多桌面软件发展的通病，我发现经常有个问题是这些做软件的都很喜欢把自己的功能做到大而全，经不起用户的呼唤和自我 膨胀。想起当年看图又快又爽的acdsee，几经升级最后俨然变身成一个集图片浏览、截图、编辑外带图片数据库的庞然怪物，当然，也就遭到了我的无情抛 弃！如果说桌面软件的功能升级往往是为了每年再卖一次版本的钱的话，那么我希望雅虎乐译不要这么着急，既然是免费软件，就应该好好研究一下词典用户的根本 需求到底是什么。一个好的产品不是看怎么加，而是看如何减，但最终留下的是用户最精华最爱用的部分。也许设计这个功能是雅虎为了增加自己的搜索量吧，体现 自己360度全能搜的思想（这个口号比较狠，直指百度啊，呵呵）。<br />\n<span style=\"color: #006699;\"> 综合打分：★★★<br />\n优势点评：小巧，功能比较多，具备网络释义功能，有生词本功能<br />\n劣势点评：作为特色的移动笔功能比较鸡肋、不能在PDF中取词，搜索功能显多余，网络查询结果不理想，没有例句功能<br />\n官网地址：<a href=\"http://soft.cn.yahoo.com/ly/index.htm\" target=\"_blank\">http://soft.cn.yahoo.com/ly/index.htm</a></span></p>\n<p><span style=\"font-weight: bold;\">五、灵格斯：今天你升级了没有？</span><br />\n<img decoding=\"async\" src=\"http://www.lingoes.cn/anylog/data/user_lingoes/group_2/0/upload/19-4-2.jpg\" border=\"0\" alt=\"2006-12-13_221847.jpg\" /><br />\n灵格斯是我用过的另一款桌面词典，主要是看同学在用，就安了一个试了试。据说支持60多种语言的互查互译，不过对于大多数用户来说最关心的还是英汉之间的互译吧。<br />\n灵格斯安装下来不大，因为你装的只是一个壳而已，只包括一个基础英汉词典，你需要到他的官网上去下载需要的词典和辞书，这些都是免费的，所以只要硬盘空间够大，就找你想要的词典尽情地下吧，呵呵。<br />\n灵格斯的界面风格值得称道，淡青色的主题，布局紧凑而不显凌乱。在提供了主界面查询和鼠标取词的同时，灵格斯还提供了剪贴板取词方式，就是说文本文字 一经被复制粘贴到系统的剪贴板里，灵格斯都会对该文本进行词典搜索，并将与之匹配的词条解释显示出来，对于无法使用鼠标取词的某些软件如PDF、基于 Java 的某些应用程序等可以利用这个功能进行辅助翻译(鼠标无法直接在PDF文档中取词)。灵格斯还提供了一个&#8221;海词在线&#8221;的搜索框，号称如果有在词典中搜不到 的词试试这个，这个技术的提供者也是dict.cn，不过从实际使用效果来看，这个功能和有道雅虎的网络释义功能是完全不一样的，所以实际使用价值也一 般。此外，灵格斯还提供了全文翻译的功能，目前好像也在制作wikipedia，期待一把，呵呵。<br />\n灵格斯也有一些让人不爽的地方，比如会强制你升级，而且据说不管你有没有联网都会要求你升级，不升级就不能用（真神奇-_-!!!），另外灵格斯对变 形词（比如词的复数形式、时态的变化等）的识别能力很烂。最愤怒的是，最近灵格斯的强制升级后，直接插入了很多广告！甚至取词窗口也会给广告。我觉得作者 已经抓狂了，作为普通用户，我们不是不能理解软件作者的收入压力，但如果在每一个查询结果、取词里都放广告，这对我的使用是非常大的干扰。就像我们看电视 的广告插播，如果达到了每一次主角张嘴，就插一个5秒广告，那这电视就没法看了！<br />\n<span style=\"color: #006699;\"> 综合打分：★★★☆<br />\n优势点评：丰富的免费词典可供下载，支持语言丰富<br />\n劣势点评：在新词的支持上还不够，强制升级，广告干扰，对变形词的识别能力差<br />\n官网地址：<a href=\"http://www.lingoes.cn/zh/index.html\" target=\"_blank\">http://www.lingoes.cn/zh/index.html</a></span></p>\n<p><span style=\"font-weight: bold;\">后记：桌面词典软件07年终点评</span><br />\n以上是就我个人的使用和了解情况对几款桌面词典软件的简单点评，目前我的一般使用组合是babylon+有道桌面词典，babylon用来看基础词语 和wikipedia，有道用来查各种网络新词、英文名称和缩写，偶尔也用用金山词霸，这些基本上就可以满足我的日常工作和学习的要求了。不过桌面词典这 个东东感觉还远没有达到完美，发展空间很大，在操作性和取词准确性上还需进一步的提高，另外还有很多网友都期盼的传说中的ocr功能和mobile版本等 等，希望今后的桌面词典能给我更多惊喜，严重持续关注中，呵呵，也许这就是我们所追求的互联网精神和&#8221;新软&#8221;的精神吧：）<br />\n最后再列一下各个软件的评分和官网地址，算是总结好了。<br />\n<span style=\"color: #006699;\">金山词霸2007　★★★★　　　<a href=\"http://www.kingsoft.com/\" target=\"_blank\">http://www.kingsoft.com/</a><br />\nbabylon　　　　★★★★☆　　<a href=\"http://www.babylon.com/\" target=\"_blank\">http://www.babylon.com/</a><br />\n有道桌面词典　★★★★☆　　<a href=\"http://dict.yodao.com/desktop/\" target=\"_blank\">http://dict.yodao.com/desktop/</a><br />\n雅虎乐译　　　★★★　　　　<a href=\"http://soft.cn.yahoo.com/ly/index.htm\" target=\"_blank\">http://soft.cn.yahoo.com/ly/index.htm</a><br />\n灵格斯　　　　★★★☆　　　<a href=\"http://www.lingoes.cn/zh/index.html\" target=\"_blank\">http://www.lingoes.cn/zh/index.html</a></span> （转载完）</p>\n</div>\n<div><span style=\"color: #ff0000;\"><strong>xbeta注：说说免费！</strong></span></div>\n<div>善用佳软的宗旨是尊重版权，是“善”，而不是一味免费。病毒是免费的，流氓软件是免费的，我们不需要它。免费软件，或者说freeware是给开发者分享其作品，而不减少用户的自由(free)，既包括经济方面，也包括其他方面。</div>\n<div>回到本文介绍的软件上。我最赞成的版权方式是babylon：用户要买软件（钱给软件开发者），要买词典（钱应该主要给词典版权人）。而按此论，金山 词霸实在是太便宜了：百元价格，得到了一流的词典软件，和多款经典的词典。用户不仅要看到某些价值10元的物品免费，更要看到价值千元的物品售价百元也是 极好的。</div>\n<div>我现在不太喜欢Lingoes。主要原因是很早就开始的&#8221;强行升级,不升级不能用&#8221;风格；辅助原因是将要开始的广告。它和NetAnts、Google服务一样，应该称为广告软件，不应泛称为免费软件。</div>\n<div>另外，Lingoes、StarDict的词典，尤其一些经典词典，无论是作者还是网友提供，只要未向版权者付费，就存在版权问题。</div>\n<div>另，不赞成本文作者对待版权的态度。但我尊重作者的版权，所以在征得同意才转载之后，并未直接修改其原文，而是加以注释。</div>\n<div>顺便说一下，转载完本文之后，我现用的是有道词典。</div>\n<div>（最后更新2007-12-24）</div>\n<p>></iframe></p>\n","protected":false},"excerpt":{"rendered":"<p>※感谢作者Ravanelli许可善用佳软转载。 ※ 善用佳软提倡使用正版或免费软件。本文中Lingoes、有道 [&hellip;]</p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":["1 文本办公","1.7 翻译工具","未分类"],"tags":["translation-app","all"],"_links":{"self":[{"href":"https://xbeta.info/wp-json/wp/v2/posts/389"}],"collection":[{"href":"https://xbeta.info/wp-json/wp/v2/posts"}],"about":[{"href":"https://xbeta.info/wp-json/wp/v2/types/post"}],"author":[{"embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/users/2"}],"replies":[{"embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/comments?post=389"}],"version-history":[{"count":0,"href":"https://xbeta.info/wp-json/wp/v2/posts/389/revisions"}],"wp:attachment":[{"href":"https://xbeta.info/wp-json/wp/v2/media?parent=389"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/categories?post=389"},{"taxonomy":"post_tag","embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/tags?post=389"}],"curies":[{"name":"wp","href":"https://api.w.org/{rel}","templated":true}]},"wp_type":"post"}