{"id":435,"date":"2007-07-08T12:43:00","date_gmt":"2007-07-08T04:43:00","guid":{"rendered":"http://xbeta.info/?p=435"},"modified":"2007-07-08T12:43:00","modified_gmt":"2007-07-08T04:43:00","slug":"study-wubi","status":"publish","link":"https://xbeta.info/study-wubi.htm","title":{"rendered":"xbeta学五笔一年之总结:与要学五笔的朋友分享"},"content":{"rendered":"<p><img decoding=\"async\"  src=\"https://img.xbeta.info/wblt-logo.gif\" /><br />\n正月初四，岁属丙戌。大吉，宜出游，宜上网，宜打字。亥时，一室皆静。Total Commander文章译毕，信步<a href=\"http://www.wbfans.com/bbs/index.php\" target=\"_blank\">五笔爱好者论坛</a>，读诸侠往日精华贴，不觉心有所动。渺渺中，一声音至：“君为五笔曾撰文否？灌水不算……若无，何不答吾所问，以为总结，既有助于自己总结，亦有助于来者。”回视桌面，则一纸问题，历历在目，作答如下。</p>\n<h2>问：学(用)五笔多长时间了？</h2>\n<p>答：从2005年初开始学五笔，到现在（06年写此文时）差不多一年。注意，用五笔一年后的总结，并非学习过程要用一年时间。</p>\n<h2>问：水平如何？</h2>\n<p>答：以前测过几次，很长时间未测了，现打单字，估计50-80字/分钟。</p>\n<h2>问：怎么看待这一水平？</h2>\n<p>答：以前打拼音时，用<strong>拼音之星</strong>输入法谭码方案（双拼2键+形码1键）整句输入，也能达到80余字。所以现在用五笔，仅从速度来看，可能还比不上以前。明确回答这个问题，自己当然不能满意。但在遇到这个问题之前，也没有觉得太慢。总起来看，还要多多练习，提高熟练度，至少达到120字左右。</p>\n<h2>问：从上一问，似乎你在拼音方面已经算是较高水平了。还有，那个谭码，好象是很偏门的武功。在详聊五笔之前，能补充一下对拼音输入法的看法吗？</h2>\n<p>答：说来话很长了。我最初计算机课——就是著名的计算机文化基础——正式学的输入法是“二笔字型”，也叫太极码、阴阳码，很长时间听不到消息了。结果前不久又在网上看到，好象是第二次青春，呵呵。学完二笔，在打字测试后，老师说，你打得还挺快的。我说，没有啊，周围不是好多同学打字比我更快吗？老师说，他们都是用的拼音。:-(<br />\n因为二笔字型并不普及，所以后面偶然打字，用得都是windows自带的输入法。<br />\n到了98年，因为写论文，打字很多，就仔细研究了一下，发现了智能ABC的一些快速输入、形码减少重码等。但是，打字，还是用智能ABC的双拼——这要补充一下，拼音输入法很多高级功能，或称为贴心功能，到了双拼就不能用了。但是，当时的智能ABC，或者说是word有bug，打多了不仅词库出错，还会导致word死掉——打了半天的字，全费了。所以，转而用微软拼音，仍然是双拼——这比较郁闷，因为两者的双拼方案不同，当时也不能自定义。后来还是比较舒服的。闭着眼睛打一段话，睁眼看一下，修改几个字就OK了。<br />\n再后来，网络出现，各种输入法也争奇斗妍。中文之星、紫光、加加都不错——但我用得并不多。因为我用得是另外一种很优秀，但非主流的输入法——拼音之星：外挂式，很小巧（卖点之一就是可装在一张软盘上），能整句输入，功能也很强，最好的一点，对多种双拼方案都支持。用了很多年，跟着它升级，也解决它和其他软件冲突的问题、乱码的问题、破解（当时未注册，一是因为没有钱，二是因为绑定机器码，不适合我几台PC经常换）。后来，为了不断提高速度，开始用它的谭码方案，就是双拼+部首的音码，一律每字三码，如果打词或整句，重码很少。举例：张=ahg（a=zh, h=ang, g=弓gong的第一个字母）。但是对专业词汇或人名，仍然不能闭目盲打（还是有不少重码）。<br />\n就是为了追求极少重码（重码数量小到可以记住），我才想到了五笔。</p>\n<h2>问：你讲起拼音还挺有兴致的嘛。后来为了极少重码就学五笔了？</h2>\n<p>答：还是犹豫了很长时间。因为当时我打字速度还算比较快。极少重码，只是一个心理爱好，并不是一个现实需求。很多时候，考虑到不在软件上浪费太多时间，也是潜意识中对五笔有一种畏惧，所以并没有马上学五笔。后来用了五笔后，平时用GB单字，实现了基本无重码的要求。</p>\n<h2>问：要不要学五笔？为什么学五笔？你当时怎样想的？</h2>\n<p>答：五笔输入法比拼音输入法的录入速度还是快一些的，尤其是生涩文章、古文、姓名，或准确率极高的情况下。但用五笔的不一定都快，用拼音的不一定都慢，还是看个人。或者讲，用拼音打字慢的，学了五笔也快不到哪里。但为什么我要学五笔？除了追求无重码的自由之外，还有两点很重要：一是想让自己再<strong>自我挑战</strong>一次，而不是故步自封，尤其要打破到了多少岁不再学新东西的束缚；二是认识到学习的成本是<strong>一时</strong>的，而好处或者说打字是<strong>一世</strong>的。学习五笔，无论从精神上，还是从实用上，都是值得的。</p>\n<h2>问：当时如何学的？看书？软件？电子教程？</h2>\n<p>答：主要是看电子教程——现在想来，买一本书是必要的，然后就找打字软件练习，先一级简码，再二级，再三级……<br />\n当时还是走了很多弯路的：现实中没有可交流的人，网络资源也不知道这个论坛。所以在输入法选择、练习软件选择上都走了弯路。当时只能baidu google。<br />\n现在向刚学五笔的同仁推荐，第一个就是到五笔论坛来读文章。</p>\n<h2>问：学习的过程痛苦吗？</h2>\n<p>答：肯定有这个过程，但现在不记得了。</p>\n<h2>问：你当时选的哪种方案？输入法？练习软件？</h2>\n<p>答：当时根本没有86、98的概念。学了一段，才知道学的是86，以前还以为是新旧两种版本呢。如果再让我从头来一次，会如何选择呢？详见<a href=\"#986\">后文</a>。<br />\n输入法，当初用的是智能陈桥——不好意思，是破解版。不过，时间不长，很幸运，就认识了极点。这方面，下文详述。<br />\n学习软件，注意不是练习软件。在入门时，学习软件很重要，因为它可以提供实时的反馈、拆分示例。我好象用过五笔打字员和另外一种（名字忘了）。两者功能差不多，一个大（5M）一个小（1M左右），我推荐小的那个。对新学者，按五笔论坛上推荐的几个，分别试一下，选一个自己喜欢的就好。</p>\n<h2>问：怎么练习的？</h2>\n<p>答：每天中午打十几分钟——因为当时五笔打字太慢，不可能在工作中用，所以，单独找时间练。现在想来，应该每天练习相同内容——很多人的实践都证明，这是最有效的办法。<br />\n不过，总起来讲，开始阶段只要能坚持下来就好。与其讲科学，不如讲乐趣。先把五笔堡垒占领了，再提高巩固。</p>\n<h2>问：后来与五笔论坛的关系是如何发展的？</h2>\n<p>答：那是一个风高月黑的夜晚……（此处略去500字）……我与极点、五笔论坛的感情就开始了。<br />\n通过读文、发贴请教，学到了很多东西。下面我会把自己的心得，尤其是走过弯路的，再小结一下。有些时候，都有些病态了。每天要上来，看看有没有新文章。十一的时候，仲秋的时候，等着极点升级……唉（此处再略去500字）！</p>\n<h2>问：那好，既然有心得，不妨说一下吧。</h2>\n<p>答：好，别怕长——我尽量简短。</p>\n<h3 id=\"986\">一 先说86与98（本段于2007-09-21修订推荐86）</h3>\n<p>先做一下入门介绍：大家谈到五笔时，可能指三个问题：</p>\n<p>①输入法：比如极点五笔、王码五笔、海峰、五笔加加、酷极……</p>\n<p>②编码：一般只有2种，就是86和98。</p>\n<p>③词库：开放的输入法有多种词库（第三方）。</p>\n<p>对拼音用户而言，①和③都易理解。其实②也不难，它好比是全拼vs双拼，更准确的比喻，是不同的双拼方案。直白地说，就是某些字，在86版编码方案和98版编码方案中，拆分字根可能会略有差别。</p>\n<p>差别大吗？不大，估计3-5%。所以，学会一种，再转另一种也不是很难。</p>\n<p>为什么有98？因为86编码有些不太“科学”，所以有所改进。但这里的“科学”并无确凿标准，所以，我认为就算98有100分，则86也有95分。或者在拼音用户或其他形码用户看来，两种方案都不科学。</p>\n<p>对用户而言有何区别？所有输入法安装后都有86编码，只有极少数大胆、或第3方修改版才提供了98编码——因为98专利属王码公司；并且，80%以上的用户在用86版；80%的五笔学习资料都是86版；当大家提到五笔时，如果不加说明，也是86版。</p>\n<p><strong>以前我推荐新手学98，现在更正为推荐86！</strong></p>\n<p>除非不怕这些情况：下载了极点后能找到并会安装98词库；不容易打学习资料；试用新的五笔输入法发现没有98词库；用别人的机器上的五笔发现有些字打不出来（他在用86）……</p>\n<p>xbeta初学86（那时不知有86和98），后试了一段98，仍回归86。</p>\n<h3>二 再说输入法</h3>\n<p>①王码、海峰；加加；极点、小鸭、酷极（注意分号）都是一流的。用哪个都好。第三类是功能型的，就算坚守第一类，也值得一试。<br />\n②新手我推荐极点，因为它在论坛上用户数、支持贴子、词库最多。<br />\n③智能陈桥我用过，也看过它的发展历史介绍。惋惜！还是用极点小鸭等吧。当然，喜欢陈桥的也不用太在意我说的话。</p>\n<h3>三 再说单字</h3>\n<p>①说实话，一些常用单字的编码打起来不是很顺（如编-4键的动作不是很顺，顺-本身的3码也不是很顺——也可能是我个人感觉。还有，一些常用的简单字要拆得比较复杂，如西、古、雨、寸）<br />\n②作为练习，打单字是必要的，我现在就是在打单字中。<br />\n③打单字要把“空格”当成一个码元来看。如“看”要理解成“rhf ”4码，这样直接上屏不会停顿。</p>\n<h3>四 个性化与通用</h3>\n<p>①<strong>安心就好，效率和通用性其实并没有想象的重要</strong>。人总有时间可以浪费，也就有时间多敲几个键，或把自己的个性输入法再装一次。过度个性化/优化（追求效率，无非少击几次键）和死守通用（别人的机器上也有此输入法，最好配置、词库也相似）都是心理偏好，而非现实需求。从现实来讲——这里我说得很不客气，因为也是在批判我自己的这种行为和心态——比如设一个三键自动上屏，甚至查教程做某些优化，结果只是在几千次击键中少按几十个键而已。真正时间宝贵的人，会通过减少上网（包括上五笔论坛、善用佳软）节省这些时间。所以，不要太在意效率。你真正追求的是一种体验和感觉。<br />\n②建议新手把极点default码表复制一下，改一个自己的名字，字词不妨随便加减。或者，干脆不要考虑这事。<br />\n③再说一句，真正幸福的五笔用户，是几年前偶然碰到极点或者加加乃至智能，而一直使用，懒得更换和了解其他输入法或词库，一心提高速度的人。而不是我们这些总不停观望、徘徊的人——当然，世界也少不了我们，呵呵——否则极点如何进步，小鸭、酷极如何出现，很多词库如何出现。对个人和对群体，结论和价值是不一样的。人生啊！</p>\n<h3>五 其他心得</h3>\n<p>①很多词库、程序、工具（如极点工具箱dtools)在论坛上不一定容易找，不妨到论坛的FTP、输入法天空找找，或与个人Email联系。<br />\n②极点词库是txt格式，觉得dtools不容易上手（我就是这样），也可以用擅长的文本编辑器（俺用gVIM）<br />\n③如果不是KB必争，则极点的集成版是不错的选择<br />\n④把常用的英文（id）、网址（Email）、段落（签名档）定义为词组（编码为，可以减少中英文切换，和加快输入速度。如俺键入xbeta，极点就会出现“xbeta <a href=\"mailto:xbeta@163.com\" target=\"_blank\">xbeta@163.com</a>”供选择，而无须切换到英文或以分号引导。五笔论坛的签名不能把url自动转化为链接（当然可用UBB标签），而正文就可以，所以，准备以后不用签名，而用词组输入。<br />\n⑤我打单字，不是设为“单字模式”，而是用单字字库。因为单字模式下④的功能不可用。<br />\n⑥如果有自定义长词条，且多重码时（如你的N个签名档都定义为zzqm），采用候选窗N行比较好。<br />\n⑦论坛发贴要谦虚，尽管杜老师和版主很大度！不要动不动XX输入法的bug，很可能这样损害的是发贴人的信誉，而不是软件的信誉。有建议或问题，如果实在不想（唉！）看以前的贴子，也尽量换一种口气。不要“为什么不能……”“强烈建议增加………”，最好“……怎么设置？我没找到此功能”。因为多数情况下，一个新手的问题或发现，往往是自己没找到设置或未进行正确设置。对于真正的问题，作者会认真处理的。俺提过的 <a href=\"http://www.wbfans.com/bbs/dispbbs.asp?BoardID=3&amp;ID=20927&amp;replyID=&amp;skin=1\" target=\"_blank\">→ 关于gVIM和极点的两个问题</a>，是多么的谦虚啊（说这话的时候，又是多么的不谦虚啊，呵呵）！没说是bug，因为我确实不知道是哪里的问题，是gVim？是极点？是windows？还是rpwt？我不知道。也不是“强烈建议”，因为这不是一个大问题，gVIM用户本来就少，进行设置才出错不影响通常的使用——而是作为一名用户向开发者报告使用情况。——但是，开发者及时答复，并在新版中解决了问题。再次感谢！<br />\n⑧关于极点与unicode。此段删除，因为极点6已实现Unicode。<br />\n⑨简化。极点，不用skin 背景图 声音 状态栏。<br />\n⑩插件，现在只用一个，就是带0的日期插件2006-02-02。查询、直通车都没用。</p>\n<h2>其他问题</h2>\n<p>问：能休息一下吗？<br />\n答：不能——因为文章马上结束了，呵呵</p>\n<p>问：你还希望我问什么问题？<br />\n答：你？！你不能问“请问您还有什么要补充的吗？”</p>\n<p>问：请问您还有什么要补充的吗？<br />\n答：四个字。<br />\n首先是“谢谢”！<br />\n感谢杜老师开发了这么好而且免费的极点输入平台！<br />\n感谢狐管及其他大侠及全体积极的网友维护论坛并撰写文章、回答问题，让我不断进步！<br />\n感谢酷极、小鸭、加加、海峰等软件开发者和极爽、窝子、64in1等词库制作者，让极点不孤单，让用户有更多选择！<br />\n然后是“再见”！</p>\n<p>问：谢谢您接受我的采访。<br />\n答：不客气——就是自问自答嘛！（完）</p>\n<p>2006-02-01:初稿。<br />\n2007-09-21:修改98编码处。<br />\n2013-03-21：修复图片。</p>\n","protected":false},"excerpt":{"rendered":"<p>正月初四，岁属丙戌。大吉，宜出游，宜上网，宜打字。亥时，一室皆静。Total Commander文章译毕，信步 [&hellip;]</p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":["1.1 输入法","未分类"],"tags":["五笔","输入法","all"],"_links":{"self":[{"href":"https://xbeta.info/wp-json/wp/v2/posts/435"}],"collection":[{"href":"https://xbeta.info/wp-json/wp/v2/posts"}],"about":[{"href":"https://xbeta.info/wp-json/wp/v2/types/post"}],"author":[{"embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/users/2"}],"replies":[{"embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/comments?post=435"}],"version-history":[{"count":0,"href":"https://xbeta.info/wp-json/wp/v2/posts/435/revisions"}],"wp:attachment":[{"href":"https://xbeta.info/wp-json/wp/v2/media?parent=435"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/categories?post=435"},{"taxonomy":"post_tag","embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/tags?post=435"}],"curies":[{"name":"wp","href":"https://api.w.org/{rel}","templated":true}]},"wp_type":"post"}