{"id":91,"date":"2008-09-22T12:10:12","date_gmt":"2008-09-22T04:10:12","guid":{"rendered":"http://192.168.5.119/2.2/?p=91"},"modified":"2008-09-22T12:10:12","modified_gmt":"2008-09-22T04:10:12","slug":"freewb-dzm","status":"publish","link":"https://xbeta.info/freewb-dzm.htm","title":{"rendered":"快乐源于用户——访极点五笔开发者杜志民(转)"},"content":{"rendered":"<p>原发：《软件报》2006年9月25日 第39期<br />\n录入：踏血流红<br />\n转自：http://www.wbfans.com/bbs/dispbbs.asp?boardID=3&amp;ID=27251&amp;page=1<br />\n<img decoding=\"async\" src=\"http://img229.imageshack.us/img229/9286/duou7.jpg\" alt=\"null\" /><br />\n软件简介：极点五笔是一款由众多网友参与完善的输入法软件，强大而开放，靓丽而干净。主要特色：五笔拼音同步录入，实现会五笔打五笔不会五笔打拼音；支持屏幕取词，实现随选随造，可以包含任意标点与字符；在线删词，能快速删除重码时不需要的词组；自动智能造词，能让你在首次单字录入后，以词组形式自动录入。</p>\n<p>软件基本信息：<br />\n软件名称：极点五笔<br />\n官方网站：http://www.freewb.org/</p>\n<p>编者按：提到极点五笔，相信很多用户都对其非常熟悉。其发布至今，以其强大功能，体贴用户的设计，在短短几年的时间内，便得到了迅猛发展，知名度已和万能五笔、智能陈桥等老牌输入法齐名，甚至超越。那么与其他输入法相比，极点五笔优势何在？面对诸多具有悠久历史的输入法，极点又该如何去争取众多的普通用户呢？带着这些疑问，我们本期专访邀请了极点五笔开发者——杜志民，让他来谈谈极点，以及其他一些读者所关心的问题。</p>\n<h2>定位用户，细节成就极点</h2>\n<p>《软件报》：极点问世之前，已经有了不少被用户认可的输入法，为什么还会想到开发极点？</p>\n<p>杜志民：开发极点起因主要是个人兴趣爱好和工作需要。开始学习五笔是1991年的事，当时觉得五笔真的很神奇——25个字母便能输出成千上万的汉字，所以从那时起就对输入法产生了浓厚的兴趣。</p>\n<p>2001年，由于当时工作需要，急需一款既能支持标点符号造词，又能支持临时拼音的五笔输入法软件。当时比较著名的五笔软件一是智能、二是五笔加加，但两者都不能完全满足我的需要，所以就想到自己开发一款。</p>\n<p>《软件报》：在整个极点开发过程中是否遇上过技术难题，最终又是怎么解决的？</p>\n<p>杜志民：在极点的开发过程中，的确遇到不少技术难题。微软公开的输入法开发资料很少，基本就是一个SDK示例，说明简之又简，很多东西只能靠自己在实际开发过程中慢慢摸索。在这里，我要感谢五笔加加Plus的作者EasyCode，以及小鸭五笔的作者“迷迷糊糊”，他们帮助我解决了不少极点开发中遇到的难题；再有一个就是“自由拼音”的作者李振春，正是他的开源让不少输入法爱好者踏上了开发之旅。</p>\n<p>《软件报》：极点五笔在较短的时间内便受到用户的广泛认同，你认为它的优势在哪儿？</p>\n<p>杜志民：要说优势，个人感觉有以下几点：</p>\n<p>首先是极点的定位。由于工作原因，我与文件录入打交道比较多，知道自己及同事们需要什么样的输入法软件。像“临时拼音”：不少同事在日常工作中遇到某个字不会拆时，便切换到全拼来录入，之后再切换回去，效率非常低下。此时，我就想如果不需要切换，直接按某转换键后即可实现拼音录入岂不更好？如果再能提供五笔编码的提示，效果应该更佳。再如标点符号参加造词：象“十六大”这样带双引号的词组，传统输入法由于不支持标点符号造词，只能先输入前引号，再输“ 十六大”，之后再输入后引号，相当于一个词组拆分成3次来录入，这时我想如果标点符号能够参与造词，对录入人员来说应该也很方便，等等类似的还有很多。极点的开发，基本上都是针对上面这些实际问题点来进行的，所以有很强的针对性，更适合用户使用。</p>\n<p>其次是极点有一支优秀的测试团队，说测试团队可能有些夸张了，其实成员就是来自各行各业的网友兼五笔用户。大家从各个层面对极点进行测试、试用，并不断提出完善建议，从而使极点的用户适用面不断扩大。这里特别感谢“玉树临风”——赵永宏，早期的极点如果没有其悉心的测试与建议，可能不会走到今天。第三得益于一个良好的开发交流平台——五笔爱好者论坛（www.wbfans.com/bbs）。在这里极点收到了各种各样反馈，使之不断趋于完善。</p>\n<p>《软件报》：极点5.1版本开始提供“词典”功能，很多用户将其媲美《金山词霸》，要加入此功能原由是什么？</p>\n<p>杜志民：说极点的“词典”媲美《金山词霸》有些夸张了。最初做“词典”只是想为大家提供一个查询接口，后来一些热心网友搜集了各种各样的词典数据。特别是一些教师，他们在日常工作中很需要这样一个功能，所以就一步步做起来了。同时这个功能是以功能模块形式提供的，在安装时可选，所以对不需要该功能的用户不会增加体积或运行上的负担。</p>\n<p>《软件报》：目前不少输入法捆绑了第三方插件，但极点却并没有这么做，是真正的免费软件，那是否考虑过回报问题，为什么？</p>\n<p>杜志民：<span style=\"color: #ff0000;\">已所不欲，勿强施于人；已所欲，亦勿强施于人</span>—— 由于自己的亲身经历吧，或许还有自己做人的一些原则，使得极点向用户作出了永不捆绑的承诺。再有，开发极点5年来不光是我自己，也包括很多网友为极点付出了极大的心血和精力，它就像我的孩子一样，看到它健康、快乐地成长——为需要它的人带去一些便利也是一种莫大的幸福和快乐。</p>\n<h2>输入法平台1+1不大于2</h2>\n<p>《软件报》：输入法平台这一概念最早是什么时候开始流行的，怎么看待这种输入模式？相对于单独的输入法，它有什么优势，又有什么缺点？</p>\n<p>杜志民：就我个人认为输入法平台的鼻祖应是Windows系统内置的输入法生成器——只要按照它的规则准备好码表源文件，便能生成一种输入法。相信许多输入法老手都有自己生成专用输入法的经历。至于现代意义上的平台，应该首推万能五笔，是其将五笔、拼音、英中等输入法集成到一起。但这种集成的后果是使五笔失去了灵魂——快速盲打录入，所以我自己并没有真正使用过万能。</p>\n<p>其次，就极点的开发经验而言，不同类型的输入法，从根本上来说都有自己的特殊性，强行将其整合，未必能起到1+1&gt;2的效果。极点称为平台有一个时期，当时主要是一些二笔用户请求添加对二笔的支持，同时也实现了对一笔等输入法的支持，所以之后，极点五笔亦更名为极点中文。另外，拼音以外的输入法用户基本上集中在五笔，所以平台功能的实际意义远小于技术意义。</p>\n<p>《软件报》：你认为五笔长盛不衰的原因是什么，其他软件开发、发展是否可以借鉴？</p>\n<p>杜志民：一是先发优势。由于特定条件，电脑在中国开始流行的时候，“会五笔”是“会电脑”的同义词，由此占得先机；再加上输入法强大的使用惯性，使得五笔在形码中保持长盛不衰。</p>\n<p>其次，是五笔固有的特点。输入法软件与一般应用软件相比，有明显的特点：输入法软件是系统软件，差不多用在所有的应用程序上，所以具有很高的稳定和兼容性要求；五笔输入法软件有很强的“吸附效应”，用户习惯某输入法或输入软件后不会轻易改变，赢得用户的难度较大。由于输入法的特殊性，直接借鉴的难度较大。附带说一句，应用软件如果能很好地支持输入法，将是输入法软件、应用软件和用户三赢的局面。</p>\n<h2>智能和个性　引领潮流</h2>\n<p>《软件报》：如何看待基于网络搜索引擎的搜狗拼音输入法，其对现有输入法的模式是否有冲击？搜狐作为门户网站推出输入法，你认为其背后有什么驱动力？</p>\n<p>杜志民：如果真是以网络搜索引擎技术做输入法，那实在是以导弹打蚊子。其实大概一年前，五笔好爱者论坛上的网友Ahman便想到了这个点子，并基本得以实现。所不同的是其基于Google，其强大程度下例可见一斑：我输入了自己家庭的拼音缩写，其返回了我家的正确地址*_*。至于搜狐是如何考虑的，我就不知道了，不过作为一个门户网站，吸引用户与眼球是很重要的。</p>\n<p>《软件报》：你认为输入法日后会是一个什么发展趋势？</p>\n<p>杜志民：就拼音类来说，我认为智能化还是其不变的潮流。而对于五笔等型码来说，应该是更体贴、更个性化吧！></iframe></p>\n","protected":false},"excerpt":{"rendered":"<p>原发：《软件报》2006年9月25日 第39期 录入：踏血流红 转自：http://www.wbfans.co [&hellip;]</p>\n","protected":false},"author":15,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":["1.1 输入法","未分类"],"tags":["五笔","开发者访谈","all"],"_links":{"self":[{"href":"https://xbeta.info/wp-json/wp/v2/posts/91"}],"collection":[{"href":"https://xbeta.info/wp-json/wp/v2/posts"}],"about":[{"href":"https://xbeta.info/wp-json/wp/v2/types/post"}],"author":[{"embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/users/15"}],"replies":[{"embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/comments?post=91"}],"version-history":[{"count":0,"href":"https://xbeta.info/wp-json/wp/v2/posts/91/revisions"}],"wp:attachment":[{"href":"https://xbeta.info/wp-json/wp/v2/media?parent=91"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/categories?post=91"},{"taxonomy":"post_tag","embeddable":true,"href":"https://xbeta.info/wp-json/wp/v2/tags?post=91"}],"curies":[{"name":"wp","href":"https://api.w.org/{rel}","templated":true}]},"wp_type":"post"}